[[[[[[[[{"name": "Batman™: Arkham Origins", "url": "http://store.steampowered.com/app/209000/", "price": 36.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "24 Oct, 2013", "id_software": 209000, "description": "Batman™: Arkham Origins is the next installment in the blockbuster Batman: Arkham videogame franchise.  Developed by WB Games Montréal, the game features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two critically acclaimed games of the franchise.  Taking place before the rise of Gotham City’s most dangerous criminals, the game showcases a young and unrefined Batman as he faces a defining moment in his early career as a crime fighter that sets his path to becoming the Dark Knight. "}][{"name": "Batman™: Arkham Origins", "url": "http://store.steampowered.com/app/209000/", "price": 36.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "24 Oct, 2013", "id_software": 209000, "description": "Batman™: Arkham Origins is the next installment in the blockbuster Batman: Arkham videogame franchise.  Developed by WB Games Montréal, the game features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two critically acclaimed games of the franchise.  Taking place before the rise of Gotham City’s most dangerous criminals, the game showcases a young and unrefined Batman as he faces a defining moment in his early career as a crime fighter that sets his path to becoming the Dark Knight. "}][{"name": "Batman™: Arkham Origins", "url": "http://store.steampowered.com/app/209000/", "price": 36.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "24 Oct, 2013", "id_software": 209000, "description": "Batman™: Arkham Origins is the next installment in the blockbuster Batman: Arkham videogame franchise.  Developed by WB Games Montréal, the game features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two critically acclaimed games of the franchise.  Taking place before the rise of Gotham City’s most dangerous criminals, the game showcases a young and unrefined Batman as he faces a defining moment in his early career as a crime fighter that sets his path to becoming the Dark Knight. "}][[{"name": "Batman™: Arkham Origins", "url": "http://store.steampowered.com/app/209000/", "price": 36.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "24 Oct, 2013", "id_software": 209000, "description": "Batman™: Arkham Origins is the next installment in the blockbuster Batman: Arkham videogame franchise.  Developed by WB Games Montréal, the game features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two critically acclaimed games of the franchise.  Taking place before the rise of Gotham City’s most dangerous criminals, the game showcases a young and unrefined Batman as he faces a defining moment in his early career as a crime fighter that sets his path to becoming the Dark Knight. "}][[[[[[[[[[[[[[[[[[[[[[[[[{"name": "Batman™: Arkham Origins", "url": "http://store.steampowered.com/app/209000/", "price": 36.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "24 Oct, 2013", "id_software": 209000, "description": "Batman™: Arkham Origins is the next installment in the blockbuster Batman: Arkham videogame franchise.  Developed by WB Games Montréal, the game features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two critically acclaimed games of the franchise.  Taking place before the rise of Gotham City’s most dangerous criminals, the game showcases a young and unrefined Batman as he faces a defining moment in his early career as a crime fighter that sets his path to becoming the Dark Knight. "}][{"name": "Counter-Strike: Global Offensive", "url": "http://store.steampowered.com/app/730", "price": 24.99, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 1, "release_date": "21 Aug, 2012", "id_software": 730, "description": "Counter-Strike: Global Offensive (CS: GO) will expand upon the team-based action gameplay that it pioneered when it was launched 12 years ago. CS: GO features new maps, characters, and weapons and delivers updated versions of the classic CS content (de_dust, etc.). In addition, CS: GO will introduce new gameplay modes, matchmaking, leader boards, and more. \"Counter-Strike took the gaming industry by surprise when the unlikely MOD became the most played online PC action game in the world almost immediately after its release in August 1999,\" said Doug Lombardi at Valve. \"For the past 12 years, it has continued to be one of the most-played games in the world, headline competitive gaming tournaments and selling over 25 million units worldwide across the franchise. CS: GO promises to expand on CS' award-winning gameplay and deliver it to gamers on the PC as well as the next gen consoles and the Mac.\" "},
{"name": "Day of Defeat: Source", "url": "http://store.steampowered.com/app/300", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 0, "release_date": "12 Jul, 2010", "id_software": 300, "description": "Day of Defeat offers intense online action gameplay set in Europe during WWII. Assume the role of infantry, sniper or machine-gunner classes, and more. DoD:S features enhanced graphics and sounds design to leverage the power of Source, Valve's new engine technology. "},
{"name": "Dota 2", "url": "http://store.steampowered.com/app/570", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 1, "release_date": "9 Jul, 2013", "id_software": 570, "description": "Dota is a competitive game of action and strategy, played both professionally and casually by millions of passionate fans worldwide. Players pick from a pool of over a hundred heroes, forming two teams of five players. Radiant heroes then battle their Dire counterparts to control a gorgeous fantasy landscape, waging campaigns of cunning, stealth, and outright warfare. Irresistibly colorful on the surface, Dota is a game of infinite depth and complexity. Every hero has an array of skills and abilities that combine with the skills of their allies in unexpected ways, to ensure that no game is ever remotely alike. This is one of the reasons that the Dota phenomenon has continued to grow. Originating as a fan-made Warcraft 3 modification, Dota was an instant underground hit. After coming to Valve, the original community developers have bridged the gap to a more inclusive audience, so that the rest of the world can experience the same core gameplay, but with the level of polish that only Valve can provide. Get a taste of the game that has enthralled millions. "},
{"name": "Red Orchestra 2: Heroes of Stalingrad with Rising Storm", "url": "http://store.steampowered.com/app/35450", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "13 Sep, 2011", "id_software": 35450, "description": "Red Orchestra 2: Heroes of Stalingrad, the leading tactical multiplayer WWII shooter on the PC, will take the award winning Red Orchestra franchise into the next generation of gaming. Cutting edge graphics and audio built using the Unreal Engine 3, inventive features and streamlined realism will deliver an unrivalled tactical shooter experience.   Heroes of Stalingrad will focus on the Battle of Stalingrad and the surrounding operations, both German and Russian, from July 1942 to February 1943. The game allows the player to experience one of the most brutal battles in all of human history. Delivering unrivalled accuracy and attention to detail, along with gritty, vicious combat in multiplayer and single-player modes the game will feature everything from quick, brutal firefights to more intricate and challenging tactical modes. "},
{"name": "PlanetSide 2", "url": "http://store.steampowered.com/app/218230", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 15360.0, "linux": 0, "release_date": "20 Nov, 2012", "id_software": 218230, "description": " is a free-to-play, massively multiplayer online first person shooter (MMOFPS). Empires fight on a massive scale where soldiers battle in an all-out planetary war on a scale never before seen in stunning, breathtaking detail.   battles persist when thousands of players align in this game that challenges the skill and grit through intense land, air and vehicle gameplay.  Across four huge maps, players come together in enormous battles to win control of critical territories and key resources for their Empire. With an extensive skill tree and free-form class-based system, players customize their soldier, weapons and vehicles to match their play-style, as well as the needs of their squad, outfit or Empire. The world of   is massive and persistent with every soldier capable of making a difference. "},
{"name": "Counter-Strike: Condition Zero", "url": "http://store.steampowered.com/app/80", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "1 Mar, 2004", "id_software": 80, "description": "With its extensive Tour of Duty campaign, a near-limitless number of skirmish modes, updates and new content for Counter-Strike's award-winning multiplayer game play, plus over 12 bonus single player missions, Counter-Strike: Condition Zero is a tremendous offering of single and multiplayer content. "},
{"name": "Rising Storm Game of the Year Edition", "url": "http://store.steampowered.com/app/234510", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "30 May, 2013", "id_software": 234510, "description": "Rising Storm is the next game in the award-winning Red Orchestra franchise. You know the great gameplay, innovative features and realistic audio and graphics of RO2 - Rising Storm will take this to the Pacific Theater, adding even more features, new levels, new weapons and new factions. The game will allow the player to fight across iconic locations from the famous island-hopping campaigns in the Pacific from 1942 to 1945, as the US Army and Marine Corps fight it out with the Imperial Japanese army and Special Naval Landing Forces. Players will experience beach assaults, jungle fighting, close quarters night fighting and more across Guadalcanal, Iwo Jima and Saipan, among other iconic battles. The player is able to take the part of either side – American or Japanese – battling it out online in multiplayer on up to 64-player servers. Rising Storm also introduces an entirely new type of gameplay to the franchise - asymmetrical warfare. The American’s have the apparent advantage in firepower with their fast firing semi-automatic rifles, fully automatic weapons, and devastating flamethrower. The Japanese balance this out with gameplay elements that model their raw courage, ferocity, and cunning use of equipment. Their knee mortars allow them to rain indirect fire down on their enemies from anywhere in the map. Grenades can be planted and turned into booby-traps for unwary GIs. The Japanese put very high store on close-quarter combat, with a bayonet on almost every weapon – even machine guns and SMGs. Their banzai charge suppresses the enemy making it difficult for them to return fire and gives them an opportunity to close in to use bayonets and katanas on their opponents. "},
{"name": "Natural Selection 2", "url": "http://store.steampowered.com/app/4920", "price": 45.99, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "30 Oct, 2012", "id_software": 4920, "description": "Natural Selection 2 is an immersive, multiplayer shooter that pits aliens against humans in a strategic and action-packed struggle for survival. It seamlessly combines shooter and RTS/strategy gameplay. "},
{"name": "Red Orchestra: Ostfront 41-45", "url": "http://store.steampowered.com/app/1200", "price": 16.99, "windows": 1, "mac": 1, "hdd_space": 2048.0, "linux": 1, "release_date": "14 Mar, 2006", "id_software": 1200, "description": ""},
{"name": "Battlefield 2: Complete Collection", "url": "http://store.steampowered.com/app/24860", "price": 19.9, "windows": 1, "mac": 0, "hdd_space": 9216.0, "linux": 0, "release_date": "6 Oct, 2009", "id_software": 24860, "description": "The Battlefield 2: Complete Collection features the following: Lock and load, soldier! The Battlefield 2 Complete Collection puts you on the frontlines of 21st century combat. There's a war going on and you've been dropped into the middle of it. Use the bleeding edge of military technology as you fight for one of the three military superpowers - the US, the Chinese or the newly formed Middle East Coalition. Survive in frenzied close-quarters combat in the world's most dangerous hot spots. Hit the enemy on their home turf and unleash the world's deadliest military forces, using their fury and high-tech arsenal to survive -- then complete your mission and get home alive. Battlefield 2: Complete Collection Features Battlefield 2: Special Forces Features Battlefield 2: Euro Force Features Battlefield 2: Armored Fury Features "},
{"name": "Call of Duty: World at War", "url": "http://store.steampowered.com/app/10090", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "18 Nov, 2008", "id_software": 10090, "description": "Call of Duty is back, redefining war like you've never experienced before. Building on the Call of Duty 4®: Modern Warfare engine, Call of Duty: World at War immerses players into the most gritty and chaotic WWII combat ever experienced. Players band together to survive the most harrowing and climactic battles that led to the demise of the Axis powers on the European and Pacific fronts. The title offers an uncensored experience with unique enemies and combat variety, including Kamikaze fighters, ambush attacks, Banzai charges and cunning cover tactics, as well as explosive on-screen action through the all new four-player cooperative campaign. The addictive competitive multiplayer has also been enhanced with new infantry and vehicle-based action, a higher level cap, more weapons, and a host of new Perks, maps and challenges.                     "},
{"name": "Tom Clancy’s Splinter Cell Blacklist", "url": "http://store.steampowered.com/app/235600", "price": 79.0, "windows": 1, "mac": 0, "hdd_space": 25600.0, "linux": 0, "release_date": "20 Aug, 2013", "id_software": 235600, "description": "The United States has a military presence in two-thirds of countries around the world, and some of them have had enough. A group of terrorists calling themselves The Engineers initiate a terror ultimatum called the Blacklist - a deadly countdown of escalating attacks on U.S. interests. Sam is back in his tactical suit and goggles, and he’s more lethal and agile than ever. Granted the freedom to do whatever it takes to stop the Blacklist, Sam flies from exotic locales to U.S. cities as he races against the clock to find out who’s behind this devastating threat.  Splinter Cell Blacklist builds on the stealth roots of the franchise, while exploring new directions to embrace the realms of action and adventure. Players can define their personal play styles and be rewarded for those choices. Take down The Engineers by using new gadgets such  as the upgraded Snake Cam and Micro-trirotor Drone. Splinter Cell Blacklist is also bringing back fan-favorites like the Sticky Shocker and the brutal, curved Karambit knife. Fans of stealth will be happy to make the most of Sam’s sneaking abilities to abduct and carry enemies, while   allows the player to strike with surgical precision by marking and executing multiple enemies in one fluid motion. Sam is building a whole new Echelon unit; his team, his way. Anna “Grim” Grimsdottir is his technical operations manager, CIA operative Isaac Briggs brings additional firepower, and resident hacker Charlie Cole rounds out the crew.  4th Echelon is a fully mobile ops unit with unlimited resources and cutting-edge technology aboard the re-purposed stealth airliner, the Paladin. Sam and his team are aware of terrorist attacks in real time thanks to the Strategic Mission Interface (SMI). The SMI allows 4th Echelon to receive data about mission objectives while on the move.  With the SMI, players can take advantage of the universal game economy system that allows players to fully customize and upgrade Sam, his suit, goggles, weapons, the Paladin and much more. Spies vs. Mercs is back with an new take on asymmetrical gameplay. Players will be able to face off in teams of 4 all the while creating their very own Spy or Merc according to their playstyles via thorough customization elements. The original Classic Spies vs. Mercs experience also makes its long awaited comeback for the fans.  With the SMI, the lines are blurred between the single campaign and COOP as the narrative is deepened with Sam and Briggs. Earn in-game currency and unlock additional weapons or gadgets via specialized missions assigned by Grim, Briggs, Charlie and Kobin. "},
{"name": "Arma 3", "url": "http://store.steampowered.com/app/107410", "price": 135.99, "windows": 1, "mac": 0, "hdd_space": 15360.0, "linux": 0, "release_date": "12 Sep, 2013", "id_software": 107410, "description": "Experience true combat gameplay in a massive military sandbox. Deploying a wide variety of single- and multiplayer content, over 20 vehicles and 40 weapons, and limitless opportunities for content creation, this is the PC’s premier military game. Authentic, diverse, open - Arma 3 sends you to war. "},
{"name": "America's Army 3", "url": "http://store.steampowered.com/app/13140", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "17 Jun, 2009", "id_software": 13140, "description": "Start playing America's Army 3 today. America's Army fans and new players alike can now experience America's Army 3, the official U.S. Army game, which has more authentic military elements including training, technology, weapons, and audio than any other military game.   Built on Unreal Engine 3, AA3 delivers stunningly realistic characters, environments, lighting effects, animations, and team-based experiences. In the game where Every Detail Counts™, players are bound by Rules of Engagement (ROE) and gain experience as you navigate challenges in team-based, multiplayer, force-on-force operations. With 15 different map/mission combinations and exclusive advanced training that allows you to unlock new abilities and customize your gear, you'll experience Soldiering in the U.S. Army like never before.    Find strength like no other in a game like no other. Start your mission now!  When you play AA3 on Steam, you'll earn Steam Achievements, ranking up among your friends as you earn distinguished status, badges, medals and ribbons. With AA3 on Steam, you can also save your keyboard bindings to the Steam Cloud - just login to your Steam account and fire up AA3 on any PC to utilize your custom settings. "},
{"name": "Crysis 2 - Maximum Edition", "url": "http://store.steampowered.com/app/108800", "price": 39.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "22 Mar, 2011", "id_software": 108800, "description": "Aliens are decimating New York City, only you have the technology to survive.  Adapt in real time using the unique Nanosuit 2 Stealth, Armor and Power abilities, then tackle the alien menace in ways a regular soldier could only dream of.   Crysis 2 redefines the visual benchmark for console and PC platforms in the urban jungle of NYC.  Be The Weapon. "},
{"name": "Crysis", "url": "http://store.steampowered.com/app/17300", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 12288.0, "linux": 0, "release_date": "13 Nov, 2007", "id_software": 17300, "description": ""},
{"name": "Call of Duty", "url": "http://store.steampowered.com/app/2620", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "29 Oct, 2003", "id_software": 2620, "description": "Call of Duty® delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history. Play through the chaos of battle as part of a well-trained squad, that lays down covering fire and pulls its wounded to safety. In addition to authentic squad movements and tactics, each soldier's distinct personality and training comes out on the battlefield. No one soldier or nation single-handedly won the war. For the first time, Call of Duty® captures the war from multiple perspectives, through the eyes of American, British and Russian soldiers. Battle through 24 missions spanning 4 interconnected historical campaigns. Take on mission objectives ranging from sabotage and all-out assault to stealth, vehicle combat and rescue. Authentic weapons, locations, vehicles and sounds of war all contribute to the realism, immersing you in the most intense World War II experience yet. © 2006 Activision Publishing, Inc.  Activision and Call of Duty are registered trademarks of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners. "},
{"name": "Call of Duty® 4: Modern Warfare®", "url": "http://store.steampowered.com/app/7940", "price": 34.99, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 0, "release_date": "12 Nov, 2007", "id_software": 7940, "description": "The new action-thriller from the award-winning team at Infinity Ward, the creators of the Call of Duty® series, delivers the most intense and cinematic action experience ever. Call of Duty 4: Modern Warfare arms gamers with an arsenal of advanced and powerful modern day firepower and transports them to the most treacherous hotspots around the globe to take on a rogue enemy group threatening the world. As both a U.S Marine and British S.A.S. soldier fighting through an unfolding story full of twists and turns, players use sophisticated technology, superior firepower and coordinated land and air strikes on a battlefield where speed, accuracy and communication are essential to victory.  The epic title also delivers an added depth of multiplayer action providing online fans an all-new community of persistence, addictive and customizable gameplay. "},
{"name": "DCS World", "url": "http://store.steampowered.com/app/223750", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 10240.0, "linux": 0, "release_date": "18 Mar, 2013", "id_software": 223750, "description": "Feel the excitement of flying the Su-25T \"Frogfoot\" attack jet and the TF-51D \"Mustang\" in the free-to-play Digital Combat Simulator World! DCS World is a vehicle combat simulation game created by an inspired development team. DCS World uses a powerful engine that delivers realistic gameplay.  The battlefield includes a spectacular mission area - the location of the Georgian conflict in 2008. Fly the Su-25T in a massive, semi-dynamic campaign to achieve dominance in the skies over Georgia! Experience the amazing flight dynamics and interactive cockpit of the TF-51D and understand why the Mustang is often regarded as the greatest fighter of the Second World War.  The huge variety of aircraft, land units and warships are included from countries such as the United States, Russia, the United Kingdom, France, German Spain and others. Units are controlled by sophisticated Artificial Intelligence (AI) and they have an amazing levels of detail. This all allows for the creation of engaging, real-world combat missions in this flashpoint region. DCS is a true \"sandbox\" simulation that can and will cover multiple time periods covering many types of combat and civilian units. Your exhilarating experience will be extended through additional DCS modules available through Steam. Such modules include the A-10C Warthog, Ka-50 Black Shark, the P-51D Mustang, UH-1H Huey, Mi-8MTV2, and ground combat control with Combined Arms. "},
{"name": "Haunted Memories", "url": "http://store.steampowered.com/app/241640", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 1024.0, "linux": 0, "release_date": "30 Sep, 2013", "id_software": 241640, "description": "Every time we wake up on the other side we have a small chance of falling in to never ending dream. Honestly – which side is the true one? We wake up in our beds, but is it possible to remember second awakening? You remember well what you have done in your dream, what happend, who was there and what was your goal or desire. Yes, but WHEN you have woke up? When you have crossed the barrier? How you have entered that world and why it often ends in some sort of tragedy, that pushes you out? The only thing that left are memories of dream. Shattered memories, Haunted Memories. Now you have a chance to visit this haunted realm consciously, but you have to be warned. Remember – once entered, can’t be left. To the very end of your sanity, all six episodes of Haunted Memories are going to show you that sometimes darkness leads to light. "},
{"name": "Contagion", "url": "http://store.steampowered.com/app/238430", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 7168.0, "linux": 0, "release_date": "25 Oct, 2013", "id_software": 238430, "description": " -GamesBeat  -RockPaperShotgun  -Bloody-Disgusting  -Canadian Online Gamers  -Hooked Gamers  - Each play through is never the same with our built-in randomization system that changes the game/round each time you play!  - Our advanced gibbing system will immerse you into the game with limbs and organs being blown or hacked off!   - Realistic ambient and sound effects that instantly draw you into the games dark apocalyptic atmosphere!  -  Slow moving undead that can only be truly laid to rest with a bullet to the brain or enough wasted lead in their body wasting away the ability to function.   - Over 28 vital pieces of equipment from a large selection of firearms, melee weapons, don't forget explosives, support items, tools, and much more to be added!   - Choose from a multitude of classic and new game-modes that require co-op and survival skills in which you escape, extract civilians or hunt each other! Not to mention our Panic modes, upcoming Flatline (Survival) mode and more!  - We will be releasing new content and 2 DLC Bundles in 2014... For Free! This was decided in 2010. Once you own Contagion you will never have to pay for updates or DLC bundles we develop for it... Ever. "},
{"name": "Star Conflict", "url": "http://store.steampowered.com/app/212070", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 3072.0, "linux": 1, "release_date": "27 Feb, 2013", "id_software": 212070, "description": "Star Conflict is an action-packed, massively multiplayer space simulation game that puts players in the role of elite pilots engaging in a widespread interplanetary skirmish. Three thousand years have passed since the first colonists left Earth. Now the galaxy is divided between the militant star empires and independent mercenary groups. In a remote corner of the galaxy — Sector 1337, the area of the dead — a world has been left behind. Here, the ruins of a great civilization of Aliens have recently been discovered. Huge factories and sprawling cities are falling into decay. Fragments of ships lie on the fields where massive battles were once fought. But there is not a living soul. Everything has been destroyed by a mysterious Cataclysm — a pulsing anomaly that burned out all life within this sector. This doesn’t stop mankind, the new «owner» of the Universe. Mercenaries and adventurers have flocked to the sector to sift through the ruins and loot its abandoned artifacts, without consideration of the danger. Many have disappeared — including members of well-armed expeditions — but those who have managed to return have uncovered unprecedented riches. So looters continue to come here, to find the Aliens’ lost treasures — and to fight for them. "},
{"name": "Spiral Knights", "url": "http://store.steampowered.com/app/99900", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 700.0, "linux": 0, "release_date": "14 Jun, 2011", "id_software": 99900, "description": "Band together and fight to the Core! Spiral Knights is a cooperative adventure in a persistent world with a focus on instant, fast-paced action.  Arm yourself and join the ranks of the Spiral Knights; stranded on an alien world, they must explore the ever-changing Clockworks beneath its surface in hopes of reaching its mysterious Core. "},
{"name": "Global Agenda: Free Agent", "url": "http://store.steampowered.com/app/17020", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 15360.0, "linux": 0, "release_date": "1 Feb, 2010", "id_software": 17020, "description": ""},
{"name": "Unreal Tournament: Game of the Year Edition", "url": "http://store.steampowered.com/app/13240", "price": 16.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "25 Oct, 2000", "id_software": 13240, "description": "Unreal Tournament is the original King of the Hill in the frag-or-be-fragged multiplayer gaming world. As the undisputed 1999 Game of the Year, Unreal Tournament grabbed the first person shooter genre by the soiled seat of its pants and knocked it around the room with its never-before-seen graphics, brutal edge-of-your-seat gameplay and a massive and varied feature list that gave gamers more than they ever expected. © 2000, Epic Games, Inc. All rights reserved. Epic, Epic Games, Unreal, and Unreal Tournament, and Unreal (Stylized) are trademarks or registered trademarks of Epic Games, Inc. in the United States of America and elsewhere. "},
{"name": "Unreal Tournament 2004: Editor's Choice Edition", "url": "http://store.steampowered.com/app/13230", "price": 24.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "16 Mar, 2004", "id_software": 13230, "description": "Unreal Tournament 2004 is a multiplayer first person shooter that combines the kill-or-be-killed experience of gladiatorial combat with cutting-edge technology. Ten game modes - both team-based and \"every man for himself\" -- provide even the most hardcore gamer with palm-sweating challenges through unbelievably detailed indoor arenas and vast outdoor environments. As the ultimate techno-gladiator of the future, players will take their fates into their hands, battling against up to 32 other players online in action-packed, frag-filled arenas. "},
{"name": "Half-Life: Opposing Force", "url": "http://store.steampowered.com/app/50", "price": 10.49, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 1, "release_date": "1 Nov, 1999", "id_software": 50, "description": "Return to the Black Mesa Research Facility as one of the military specialists assigned to eliminate Gordon Freeman. Experience an entirely new episode of single player action. Meet fierce alien opponents, and experiment with new weaponry. Named 'Game of the Year' by the Academy of Interactive Arts and Sciences. "},
{"name": "Deus Ex: Human Revolution - Director's Cut", "url": "http://store.steampowered.com/app/238010", "price": 34.99, "windows": 1, "mac": 1, "hdd_space": 17408.0, "linux": 0, "release_date": "25 Oct, 2013", "id_software": 238010, "description": "You play Adam Jensen, an ex-SWAT specialist who's been handpicked to oversee the defensive needs of one of America's most experimental biotechnology firms. Your job is to safeguard company secrets, but when a black ops team breaks in and kills the very scientists you were hired to protect, everything you thought you knew about your job changes. "},
{"name": "Call of Duty: United Offensive", "url": "http://store.steampowered.com/app/2640", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "15 Sep, 2004", "id_software": 2640, "description": "Award-winning developer Gray Matter Interactive follows up on the success of Infinity Ward's Call of Duty™ - winner of over 80 Game of the Year and 50 Editors' Choice awards worldwide - with Call of Duty™: United Offensive™. Take the role of American, British, and Russian soldiers in some of the most climactic battles of World War II, including the Battle of the Bulge, the invasion of Sicily, and the Battle of Kursk. Fight in tanks, jeeps, motorcycles, even a bomber. Work with your squad through snow and rain, using new weapons including flamethrowers and deployable machine guns, or by calling in artillery strikes. 13 All-New Single Player missions spanning three campaigns. 11 exciting new Multiplayer maps and 3 new multiplayer modes including Domination, Capture the Flag, and Base Assault. © 2006 Activision Publishing, Inc.  Activision and Call of Duty are registered trademarks of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners. "},
{"name": "Return to Castle Wolfenstein", "url": "http://store.steampowered.com/app/9010", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "20 Nov, 2001", "id_software": 9010, "description": "World War II rages and nations fall. SS head Himmler has Hitler's full backing to twist science and the occult into an army capable of annihilating the Allies once and for all. Battling alone, you're on an intense mission to pierce the black heart of the Third Reich and stop Himmler -- or die trying. Fighting in advanced team-based multiplayer mode, you'll wage your own WWII in an all-out Axis vs. Allies contest for frontline domination. Powered by the Quake III Arena engine, the Wolfenstein universe explodes with the kind of epic environments, A.I., firepower and cinematic effects that only a game created by true masters can deliver. The dark reich's closing in. The time to act is now. Evil prevails when good men do nothing.  "},
{"name": "Call of Duty® 2", "url": "http://store.steampowered.com/app/2630", "price": 34.99, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 0, "release_date": "25 Oct, 2005", "id_software": 2630, "description": "Call of Duty® 2 redefines the cinematic intensity and chaos of battle as seen through the eyes of ordinary soldiers fighting together in epic WWII conflicts. The sequel to 2003's Call of Duty, winner of over 80 Game of the Year awards, Call of Duty 2 offers more immense, more intense, more realistic battles than ever before, thanks to the stunning visuals of the new COD™2 engine. © 2006 Activision Publishing, Inc.  Activision and Call of Duty are registered trademarks of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners. "},
{"name": "CrimeCraft: GangWars", "url": "http://store.steampowered.com/app/38830", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "25 Aug, 2009", "id_software": 38830, "description": " is a massive expansion for the Free-to-Play Online Shooter CrimeCraft. GangWars revamps the experience for new users while also adding exciting end game content for veteran players. GangWars is set in the bloody aftermath of the Bleedout Campaign and the destruction of the Scorpion Chamber, the governing body of Sunrise City. Gangs now fight for control of the city. Build a gang and establish \"street cred\" for your crew based on individual and team achievements. Go to war against your opponents using a diverse arsenal of weapons, abilities and boosts. Capture all 20 unique combat zones and own it all, generating cash, bonuses and loot for your gang's dominance. "},
{"name": "Age Of Wushu", "url": "http://store.steampowered.com/app/265650", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 10240.0, "linux": 0, "release_date": "27 Mar, 2014", "id_software": 265650, "description": "Age of Wushu: Snail Games’ topnotch sandbox MMORPG that lets player become an aspiring Kung-Fu master and experience the captivating, oriental world of Ancient China. By combining revolutionary combat with beautiful renderings, players will master a variety of martial skills as they delve into a unique self-realization path to the pinnacle of power. Players are given tons of freedom unparalleled in modern MMORPGs in their journey to master the ancient Chinese martial arts, to delve into their character's unique story, to face the consequences of every action, and to fulfill their destiny. "},
{"name": "Divine Souls", "url": "http://store.steampowered.com/app/300040", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 4096.0, "linux": 0, "release_date": "15 Aug, 2014", "id_software": 300040, "description": "Divine Souls is a real-time action RPG centered around completing dungeon instances by leveraging an extensive combat combos system. Gain experience from enemies to strengthen your character and to unlock additional moves that unleash additional combo options. Choose from one of four unique classes each with their own distinct set of gameplay mechanics and combos. Collect loot for yourself, trade with others, or list your items into the auction house system. Dr. Hildeun has gone missing! Find out what happened as you follow your character’s investigation into Dr. Hildeun’s disappearance. Divine Souls is a free-to-play game! "},
{"name": "Torchlight II", "url": "http://store.steampowered.com/app/200710", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "20 Sep, 2012", "id_software": 200710, "description": "The award-winning action RPG is back, bigger and better than ever! Torchlight II takes you back into the quirky, fast-paced world of bloodthirsty monsters, bountiful treasures, and sinister secrets - and, once again, the fate of the world is in your hands! Torchlight II captures all the flavor and excitement of the original game - while expanding the world and adding the features players wanted most, including online and LAN co-op multiplayer. Torchlight II is fast, fun, and filled to the brim with action and loot. Adventure solo or online with your friends! "},
{"name": "Dishonored", "url": "http://store.steampowered.com/app/205100", "price": 39.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "8 Oct, 2012", "id_software": 205100, "description": "Dishonored is an immersive first-person action game that casts you as a supernatural assassin driven by revenge.  With Dishonored’s flexible combat system, creatively eliminate your targets as you combine the supernatural abilities, weapons and unusual gadgets at your disposal. Pursue your enemies under the cover of darkness or ruthlessly attack them head on with weapons drawn. The outcome of each mission plays out based on the choices you make. Dishonored is set in Dunwall, an industrial whaling city where strange steampunk- inspired technology and otherworldly forces coexist in the shadows. You are the once-trusted bodyguard of the beloved Empress. Framed for her murder, you become an infamous assassin, known only by the disturbing mask that has become your calling card. In a time of uncertainty, when the city is besieged by plague and ruled by a corrupt government armed with industrial technologies, dark forces conspire to bestow upon you abilities beyond those of any common man – but at what cost? The truth behind your betrayal is as murky as the waters surrounding the city, and the life you once had is gone forever. "},
{"name": "BioShock® 2", "url": "http://store.steampowered.com/app/8850", "price": 29.99, "windows": 1, "mac": 0, "hdd_space": 11264.0, "linux": 0, "release_date": "9 Feb, 2010", "id_software": 8850, "description": "Set approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. Players step into the boots of the most iconic denizen of Rapture, the Big Daddy, as they travel through the decrepit and beautiful fallen city, chasing an unseen foe in search of answers and their own survival. Multiplayer in BioShock 2 will provide a rich prequel experience that expands the origins of the BioShock fiction. Set during the fall of Rapture, players assume the role of a Plasmid test subject for Sinclair Solutions, a premier provider of Plasmids and Tonics in the underwater city of Rapture that was first explored in the original BioShock. Players will need to use all the elements of the BioShock toolset to survive, as the full depth of the BioShock experience is refined and transformed into a unique multiplayer experience that can only be found in Rapture. This bundle also includes the Sinclair Solutions Test Pack, Rapture Metro Map Pack, Kill ‘em Kindly, Zigo & Blanche multiplayer characters, and The Protector Trials. Requires the full game to play. "},
{"name": "Mirror's Edge™", "url": "http://store.steampowered.com/app/17410", "price": 19.98, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "13 Jan, 2009", "id_software": 17410, "description": "In a city where information is heavily monitored, agile couriers called Runners transport sensitive data away from prying eyes. In this seemingly utopian paradise, a crime has been committed, your sister has been framed and now you are being hunted. You are a Runner called Faith and this innovative first-person action-adventure is your story.                     Mirror's Edge™ delivers you straight into the shoes of this unique heroine as she traverses the vertigo-inducing cityscape, engaging in intense combat and fast paced chases. With a never before seen sense of movement and perspective, you will be drawn into Faith's world. A world that is visceral, immediate, and very dangerous.     Live or die? Soar or plummet? One thing is certain, in this city you will learn how to run. From the makers of the groundbreaking Battlefield franchise, Mirror's Edge is an action-adventure experience unlike any other. "},
{"name": "Unturned", "url": "http://store.steampowered.com/app/304930", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 200.0, "linux": 0, "release_date": "7 Jul, 2014", "id_software": 304930, "description": "Unturned is a sandbox game in the emerging multiplayer apocalypse survival genre. Rather than focusing on being an MMO it provides players with easy systems to sit down and survive the zombie infestation with their friends. Over the course of a typical adventure, groups will have a blast fortifying locations, scavenging for supplies, trying to live off the land and negotiating with other people. The game is being developed entirely with the community in focus, and tons of features are based entirely on feedback: Players can build massive forts out of structural building blocks, or build onto smaller buildings in the world with barricades. It is also possible to create traps and intricate electronic systems. More options for building are constantly being added based on what the community requests.  It is entirely possible to live off the wilderness by harvesting trees and rocks, growing crops and hunting animals down. What sort of survival stuff is added is entirely decided by the community.  The game goes where the community wants it to. The initial release map is set on the lovely Prince Edward Island, but over the next few months many more locations will arrive for players to explore depending on what the community wants to see. Currently the island has plenty of interesting locations to discover and loot.  Players can choose to enter player versus player servers and battle other players to steal their gear. Banditry is highly supported with plenty of weapons and sneaky devices.  Players can join player versus environment servers to team up with other people, and easily create clans to play with their pals. This is the first public release of the game, but new features and content are constantly getting added as a result of community feedback. You can see how far the game has come with the help of the community since the original testing prototype: "},
{"name": "S.T.A.L.K.E.R.: Call of Pripyat", "url": "http://store.steampowered.com/app/41700", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 6144.0, "linux": 0, "release_date": "11 Feb, 2010", "id_software": 41700, "description": "With over 2 million copies sold, the new episode of the most internationally successful S.T.A.L.K.E.R. series seamlessly connects to the first part of the Shadow of Chernobyl. S.T.A.L.K.E.R.: Call of Pripyat takes PC gamers once again into the vicinity of the Chernobyl nuclear reactor that exploded in 1986. This so-called \"Zone\" is a highly contaminated area cordoned off by the military and now is combed through by the so-called stalkers, modern fortune hunters, in search of unique artifacts. In the role of Agent Alexander Degtyarev, who is dressed up as stalker, the player has to investigate the mysterious disappearance of five military helicopters and thereby stand one’s ground against the various stalker groups. "},
{"name": "Project Zomboid", "url": "http://store.steampowered.com/app/108600", "price": 24.98, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 1, "release_date": "8 Nov, 2013", "id_software": 108600, "description": "Project Zomboid is an open-ended zombie-infested sandbox. It asks one simple question – how will you die?  In the towns of Muldraugh and West Point, survivors must loot houses, build defences and do their utmost to delay their inevitable death day by day. No help is coming – your continued survival relies on your own cunning, luck and ability to evade a relentless horde. For more details on the game visit or follow us on   or visit  A huge thanks to the wonderful   and   for making the awesome intro video. If you love indie games their channels are well worth a sub. "},
{"name": "The Fifth Day", "url": "http://store.steampowered.com/app/312210", "price": 27.99, "windows": 1, "mac": 1, "hdd_space": 3072.0, "linux": 0, "release_date": "25 Jul, 2014", "id_software": 312210, "description": "The Fifth Day is a post-apocalyptic survival game set in the time after mankind's extinction to the machines that it created. Your role, as one of these machines, is to survive in the hostile world left behind by man. Explore, build, and hack your way to victory in competitive online survival, or face the wastes alone in offline freeplay mode. Explore a world left by man, where rogue AI roam the lands previously inhabited by their creators and masters. With early access development, community feedback is vital towards producing the best product possible. Since the start of pre-alpha development, feedback and suggestions from the community have greatly helped in shaping the game to the state it currently is. The game has come a long way since the initial Greenlight submission, but there are still lots of improvements and features that can be made. As the game progresses through alpha, here are a few features planned for implementation: "},
{"name": "Grim Dawn", "url": "http://store.steampowered.com/app/219990", "price": 45.99, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "5 Nov, 2013", "id_software": 219990, "description": "Enter an apocalyptic fantasy world where humanity is on the brink of extinction, iron is valued above gold and trust is hard earned. This ARPG features complex character development, hundreds of unique items, crafting and quests with choice & consequence. Crate Entertainment is a small indie studio founded by the lead gameplay designer of Titan Quest. Join the Grim Dawn community and provide feedback on the ongoing development of the game. Be among the first to experience our growing world, new features and make your mark by participating in polls and discussions on our forum. You can currently play the first two \"Acts\" of Grim Dawn and up to character level 35, with some additional higher level secret areas to be found beyond the main story content. While content is still in development, the core gameplay is already fairly robust and a lot of fun. There is quite a lot of replay value between trying different classes / builds and collecting items. We're still refining gameplay based on player feedback, adding requested features and working to deliver the remaining content and additional slated features. Most players report that the current build is fairly stable with mostly mild bugs and we're always working to fix bugs as they come up. Here is some of the stuff we plan to roll out in the coming months: We expect the final game will provide about 30-40 hours for a first-time play-through on normal difficulty, depending on level of exploration / clearing. This is our first game as a studio and we intend for Grim Dawn to be a continuing franchise, not just a one-off game. So it is important that we put in the time and effort to create something we're proud of, that will help us to earn a loyal fanbase for the future. We hope you'll come be part of this experience and help us to forge a strong new addition to the ARPG genre. "},
{"name": "Sacred 3", "url": "http://store.steampowered.com/app/247950", "price": 90.99, "windows": 1, "mac": 0, "hdd_space": 25600.0, "linux": 0, "release_date": "31 Jul, 2014", "id_software": 247950, "description": "Sacred 3 is an arcade Hack ‘n’ Slash game for up to four players, set in the war for Ancaria. Choose from legendary heroes and fight together against the rise of evil. You will face hordes of grimmocs, brute beasts, legions of mercenaries and undead wizards. Develop your character’s skills and abilities and band together to use powerful co-op abilities and tactics. Victory Is Ours. Glory Is Mine. "},
{"name": "Dungeon Defenders Eternity", "url": "http://store.steampowered.com/app/302270", "price": 36.99, "windows": 1, "mac": 1, "hdd_space": 6144.0, "linux": 1, "release_date": "22 Jul, 2014", "id_software": 302270, "description": "Dungeon Defenders Eternity is the definitive version of the hit tower defense action RPG! Slice, shoot and pulverize your enemies, or build defenses to do the dirty work for you. Grab three friends and build a team of heroes from twelve different classes, each with their own defenses and abilities. Then embark on an adventure to defend Etheria from the Old Ones’ army! Eternity boasts all new missions, new features, a rebalanced endgame, secure online play (no more hacking!), along with a wide selection of content from the original game. Now is the perfect time to experience Dungeon Defenders and its expansions the way they were meant to be played! "},
{"name": "The Mighty Quest For Epic Loot", "url": "http://store.steampowered.com/app/239220", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 600.0, "linux": 0, "release_date": "18 Nov, 2013", "id_software": 239220, "description": "The Mighty Quest for Epic Loot is a brand new game from Ubisoft Montreal that thrusts you in an outrageous medieval fantasy world called Opulencia where wealth, status and showboating are the name of the game!  As a newcomer to Opulencia, you will hack n slash your way through hundreds of castles designed by the ingenious minds of your fellow players!  Don’t forget to show them who’s boss by constructing deadly keep of your very own – in this kingdom, size really does matter! "},
{"name": "Call of Cthulhu®: Dark Corners of the Earth", "url": "http://store.steampowered.com/app/22340", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "26 Apr, 2006", "id_software": 22340, "description": "Call of Cthulhu: Dark Corners of the Earth is a first-person horror game that combines intense action and adventure elements. You will draw upon your skills in exploration, investigation, and combat while faced with the seemingly impossible task of battling evil incarnate. "},
{"name": "Vampire: The Masquerade - Bloodlines", "url": "http://store.steampowered.com/app/2600", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "16 Nov, 2004", "id_software": 2600, "description": "Vampire®: The Masquerade-Bloodlines™ delivers a new type of RPG experience-one that blends all the core elements of a traditional RPG with the graphical richness, immediacy and brutal combat of a first-person action game. The game plunges players into the dark and gritty vampire underworld of modern-day L.A. as a creature of the night. Players will develop their character's powers, interact with other characters and embark on story-driven quests as they battle mortals and other vampires with an incredible array of vampire powers and weapons. Powered by Valve's Source Technology, the game is based on White Wolf's popular Vampire: The Masquerade pen-and-paper RPG series and its official clans. "},
{"name": "Star Wars Jedi Knight II: Jedi Outcast", "url": "http://store.steampowered.com/app/6030", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 800.0, "linux": 0, "release_date": "16 Sep, 2003", "id_software": 6030, "description": "The Legacy of Star Wars Dark Forces™ and Star Wars® Jedi Knight lives on in the intense first-person action of Jedi Outcast. "},
{"name": "S.T.A.L.K.E.R.: Shadow of Chernobyl", "url": "http://store.steampowered.com/app/4500", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "20 Mar, 2007", "id_software": 4500, "description": "In 1986, the world's worst nuclear disaster occurred at the Chernobyl power station. Soviet authorities established a 30km 'Exclusion Zone' around this nuclear wasteland, but in 2006 a second explosion rocked the stricken reactor, obliterating all living things and causing the Zone's boundaries to ripple outwards. From this epicenter came waves of mutated creatures, deadly radiation, and a strange, anomalous energy. The Zone was cordoned off by the military, who would shoot on sight anyone foolish enough to brave the horrors within. It is now 2012 - man has ventured further and further into the heart of the Zone driven by reports of strange 'artifacts' imbued with anomalous energy. Mercenaries and bounty hunters compete to recover these artifacts, which command extortionate prices on the black market. Others seek to find the truth behind the Zone, while some merely revel in the desolate lawlessness of the place. Whatever their motivation, over time these individuals - Scavengers, Trespassers, Adventurers, Loners, Killer, Explorers and Robbers - have become known as S.T.A.L.K.E.R.s. Awakening in the Zone, you are one such S.T.A.L.K.E.R., fighting for survival in this man-made Hell, while trying to discover the truth behind Chernobyl's sinister past and ominous future. "},
{"name": "No More Room in Hell", "url": "http://store.steampowered.com/app/224260", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 1, "release_date": "31 Oct, 2011", "id_software": 224260, "description": "\"When there's no more room in hell, the dead will walk the earth.\" A tribute to the highly acclaimed film series in which the above quote originated from, No More Room in Hell (PC Gamer's Mod of the Year 2011, ModDB's Editor Choice Multiplayer Mod of the Year 2011), is a co-operative realistic first person survival horror modification for the Source Engine. Taking inspiration from George Romero's \"Of the Dead\" series, the mod is set during a time in which the world is on the verge of collapsing into chaos from a disease whose origin is unknown. Many experts and organizations have their theories and ideas on how such a disease emerged and started to systematically destroy our very way of life, but one fact is clear to all. Whoever perishes from the disease gets up and kills, and the people they killed get up and kill. The chances of you surviving this all out war of society and the undead are slim to none. Already, there are millions of the walking dead shambling about, searching for food to eat. There's no known cure. One bite can possibly end it all for you. However, you aren't alone in this nightmare. There are still a handful of uninfected survivors left in this god forsaken hellhole, and with co-operation and teamwork, you may live long enough to fight your way to salvation. No More Room in Hell is a Half-Life 2 Zombification. The mod was founded in 2003. It switched hands and a new team took over in 2009. Beta version 1.0 was released on Halloween of 2011. A full list of the No More Room in Hell Team and contributors can be found on the about page of our website: www.nmrih.com. "},
{"name": "Edge of Space", "url": "http://store.steampowered.com/app/238240", "price": 25.99, "windows": 1, "mac": 0, "hdd_space": 900.0, "linux": 0, "release_date": "28 Jun, 2013", "id_software": 238240, "description": "Players suit up as an Operative of the Ark Corporation (ArkCo), deployed into the deepest, darkest, and most dangerous part of the universe. Fight at the edge of space against an array of creative horrors including cybernetically-enhanced laser space sharks or artillery-toting polar bears - and those are not even the strangest monstrosities to encounter!    You must terraform the entire world, craft armor, weapons, kits, and vehicles to help you explore and conquer.  Starting only with a laser pick and the gear from your pod you must immediately start gathering resources to survive.   At the absolute edge of space you will adapt or die! Good luck ArkCo Operative! (Many features listed above are currently in the game but since we are still in Early Access some will be added in the future.  Vehicles and Terraforming are among them.) "},
{"name": "Craft The World", "url": "http://store.steampowered.com/app/248390", "price": 27.99, "windows": 1, "mac": 1, "hdd_space": 200.0, "linux": 0, "release_date": "19 Nov, 2013", "id_software": 248390, "description": "Craft The World is a unique sandbox strategy game, the  mix of Dungeon Keeper, Terraria and Dwarf Fortress. Explore a random generated world populated by dangerous creatures, build a dwarf fortress, gather resources, and craft all the items, weapons, and armor you need. You control a tribe of dwarves by giving them commands to dig in certain places, attack enemy creatures, and build houses and other structures. You'll need to provide your dwarves food and clothing, as well as help them with magic when fighting against other inhabitants of the world. You start the game with one dwarf and gain additional dwarves as your experience level increases. Each game level has many layers of earth to explore, from the sky down to boiling subterranean lava. The level is randomly generated as an island, restricted by natural boundaries: oceans on the edges, lava beneath it, and the sky above. Other features include day and night and changing weather conditions. The worlds differ in size, humidity, temperature, terrain, and flora and fauna. Abandoned halls and rooms with treasure are hidden somewhere deep within the islands. One feature of the game is a user-friendly system of recipes for crafting. The recipes are organized and easily accessible. You can craft dozens of different items: building blocks for houses, furniture, decorations, weapons, armor, ammunition, and food for your dwarves. At the outset you find the recipes for basic tools and items, and build a small house with places to sleep and eat. Then, the size of the tribe increases and catches the attention of other inhabitants of the world. Most of them are night creatures and dwell underground. The worlds are full of fantasy creatures like zombies, skeletons, goblins, beholders, ghosts, giant spiders, and others. Some of them pay little attention to the dwarves, as long as the dwarves do not come into their field of vision. Others gather into quite large groups and try to break into the dwarves’ residence. Especially dangerous are the waves of monsters that appear from time to time from portals. So, do not neglect to build a safe haven with strong walls and numerous trapdoors, cells, firing towers, and secret passageways. As a divine being, you possess various spells. You can speed up the movement of the dwarves, open small portals, illuminate dark caves to scare away monsters, evoke natural magic in the form of rain or tree growth, hurl fireballs at the monsters’ heads, and find useful resources and hidden rooms underground, thereby helping to speed up resource extraction, exploration of the world, and the population growth of your assistants. "},
{"name": "Sanctum 2", "url": "http://store.steampowered.com/app/210770", "price": 27.99, "windows": 1, "mac": 1, "hdd_space": 4096.0, "linux": 1, "release_date": "15 May, 2013", "id_software": 210770, "description": "Sanctum 2 is the sequel to the world’s first Tower Defense/FPS hybrid game. Pick from four unique character classes and embark on a mission to protect the oxygen-producing Cores from hordes of deadly aliens who are threatened by their existence. Outfit your character exactly the way you want through the new and extensive customization system. Choose your own loadout of towers, weapons and perks, but choose wisely because you are humanity’s last defense against the unrelenting hordes set out to destroy it. Sanctum 2 is a new game completely rebuilt from the ground up using community feedback and innovative design to really push the bar of what an independent studio can do. In Sanctum 2, you will utilize elements from multiple gameplay genres to succeed. Construct towers and walls during the building phase before the enemies attack, then jump into the fray and blast everything to pieces in FPS mode. You can progress through the single-player campaign yourself, or play with up to four friends in co-op to discover the secrets of the planet LOEK III and learn the backstory on why the aliens are so intent on destroying the Cores you are sworn to protect.  Building on the success of the original game, Sanctum 2 stands alone as the only true FPS/Tower Defense hybrid. No other title delivers gameplay that seamlessly combines both genres. "},
{"name": "Dethroned!", "url": "http://store.steampowered.com/app/269390", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 300.0, "linux": 0, "release_date": "28 Feb, 2014", "id_software": 269390, "description": "A strat ’em up multiplayer game with celestial fairytale combat!   is an action RTS where you command a hero, gather a scruffy band of soldiers, construct defences and attack your opponent with unstoppable force! Choose a side, select a hero and head into the battle! Features include, but are not limited to  is now in Early Access and bit rough on the edges. Some things are missing or not yet in their finished form. To do "},
{"name": "Sanctum", "url": "http://store.steampowered.com/app/91600", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 0, "release_date": "15 Apr, 2011", "id_software": 91600, "description": "You think Tower Defense games are all about building? You thought wrong. Sanctum is not your average Tower Defense title. When the havoc starts, you get to join the fray! As one of the world’s first First Person Shooter - Tower Defense games, Sanctum has taken the best of both worlds to deliver an epic, one-of-a-kind experience. "},
{"name": "The Long Dark", "url": "http://store.steampowered.com/app/305620", "price": 36.99, "windows": 1, "mac": 1, "hdd_space": 1024.0, "linux": 0, "release_date": "22 Sep, 2014", "id_software": 305620, "description": "***THE LONG DARK IS AN EARLY ACCESS TITLE. THE SANDBOX IS IN A CONSTANT STATE OF IMPROVEMENT, AND IT ISN'T FINISHED. BUYING THE LONG DARK ON EARLY ACCESS SUPPORTS OUR ABILITY TO CONTINUE IMPROVING THE GAME. FOR MORE INFORMATION, REFER TO THE EARLY ACCESS INFORMATION ABOVE.*** Early Praise for Hinterland Studio & The Long Dark: \"...the team is absolutely riddled with triple-A veterans.\" - Wired \"A stylized winter wonderland...of constant creeping terror and peril.\" - Rock, Paper, Shotgun \"in The Long Dark, the apocalypse isn't the end of the world.\" - Polygon \"More than Cormac McCarthy's The Road, more than the stories of Jack London... ” - PC Gamer \"The developer is pure rockstar.\" - IGN \"They're really not f*#%ing around.\" - Penny Arcade  Imagine the lights go out, never to return. Bright aurora flare across the sky, and all humanity’s technological might is laid to waste, neutralized in a kind of quiet apocalypse. Everything that has shielded humanity from the disinterested power of Mother Nature is suddenly wrenched from us, dropping us a few links down the food chain. Food and water are scarce. The roads are no longer safe. And winter approaches… Welcome to The Long Dark —an immersive survival experience set in the aftermath of a geomagnetic disaster. Experience a unique first-person survival simulation that will force you to think and push you to your limits with its thought-provoking gameplay and mature storytelling. Immersive first-person exploration gameplay featuring a stunning, original art style. Take on the role of bush pilot Will Mackenzie, and navigate the savage beauty of the Northern Wilderness while you face the hazards of the new “post-digital” frontier. Be on the lookout for potential supply caches, all the while using survival skills to overcome hazards introduced by harsh weather, wildlife, lack of food and water, other survivors, and the mysterious aurorae that add unpredictability to an already extreme situation. Explore while balancing the needs of survival, where every decision matters. Explore a large open world in search of resources, and balance Conditions such as Hypothermia, Starvation, Dehydration, and a bevy of afflictions and injuries that can take you down, from Blood Loss to Dysentery. Morally challenging scenarios that push players to answer the question: “How far will you go to survive?”. Any survivor you meet in the world can be friend or foe. Will you risk your life to discover what they know and selflessly sacrifice for the common good, or live—and potentially die—by the adage, “might makes right”? Experience dozens of hours of free-form Survival Sandbox gameplay. Push yourself and your skill to survive as long as possible in a variety of survival scenarios, across a large open world. Balance your resources against the threats posed by mother nature, and by other AI survivors you meet along the way. Rich episodic fiction featuring dozens of locations, a cast of memorable characters, and a mature post-disaster storyline inspired by the creative risk-taking seen in many of today’s exciting television series. This isn’t the end of the world, but you can see it from here. "},
{"name": "Star Wars The Force Unleashed: Ultimate Sith Edition", "url": "http://store.steampowered.com/app/32430", "price": 36.99, "windows": 1, "mac": 1, "hdd_space": 30720.0, "linux": 0, "release_date": "15 Dec, 2009", "id_software": 32430, "description": "The story and action of Star Wars®: The Force Unleashed™ expands with the release of Star Wars The Force Unleashed: Ultimate Sith Edition, a special new version of the game that will show gamers the deepest, darkest side of the Force in a story that puts them on a collision course with Luke Skywalker himself.  The Ultimate Sith Edition includes all of the original missions found in Star Wars: The Force Unleashed as well as content previously only available via download and an all-new exclusive bonus level. Star Wars: The Force Unleashed completely re-imagines the scope and scale of the Force and casts players as Darth Vader’s \"Secret Apprentice,\" unveiling new revelations about the Star Wars galaxy seen through the eyes of a mysterious new character armed with unprecedented powers.  "},
{"name": "STAR WARS®: Knights of the Old Republic™ II", "url": "http://store.steampowered.com/app/208580", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "8 Feb, 2005", "id_software": 208580, "description": ""},
{"name": "Windborne", "url": "http://store.steampowered.com/app/221560", "price": 49.99, "windows": 1, "mac": 0, "hdd_space": 1024.0, "linux": 0, "release_date": "17 Feb, 2014", "id_software": 221560, "description": "Windborne brings social sandbox creation games to the next level. Explore a vibrant world filled with secrets to unlock and treasures to find, craft personalized furnishings and innovative artifacts, and befriend intriguing Jin to help build a new civilization. Will you seek out the clues and artifacts of the ancients, or just loot passing islands for minerals and rare plants? Bring along your friends while you play, and share your creations with the world. Where will the wind take you? Windborne is set to release in late 2014. It is being developed and self-published by Hidden Path Entertainment, Inc. "},
{"name": "Creativerse", "url": "http://store.steampowered.com/app/280790", "price": 36.99, "windows": 1, "mac": 1, "hdd_space": 2048.0, "linux": 0, "release_date": "12 Aug, 2014", "id_software": 280790, "description": "Creativerse is a sandbox adventure game set in a beautiful yet treacherous world shrouded in mystery. Adventure solo or bring your friends, unearth secrets, and tame the land together! Join us in early access to help shape the game's destiny with your feedback, or wait until official launch when it'll be free-to-play. "},
{"name": "Castle Story", "url": "http://store.steampowered.com/app/227860", "price": 34.99, "windows": 0, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "23 Sep, 2013", "id_software": 227860, "description": " is a creative voxel-based strategy game in which you can build castles one brick at a time using an army of little characters called Bricktrons.  Your goal will be to explore a vast landscape full of mysteries and dangers, and defend your castle against onslaughts of hostile creatures and possibly other players.  The world of Castle Story takes place on flying islands, high above an infinite ocean. The islands are made of voxels, cubes made of various elements, which means you can dig, carve and build anything you can imagine in the landscape. Digging underground to gather resources, stacking bricks on top of each other to build a wall or even tunnelling through a mountain is all possible and even necessary to keep your Bricktrons safe. Carefully designing your castle not only requires creativity and imagination, but thanks to pathfinding AI and physics simulations, Castle Story has layers of strategy and depth on top of an otherwise free-form sandbox experience. Castle Story will be released for Windows & Mac (with possible Linux support once Unity4 is released). "},
{"name": "Toy Soldiers: Complete", "url": "http://store.steampowered.com/app/262120", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 12288.0, "linux": 0, "release_date": "28 Feb, 2014", "id_software": 262120, "description": "The award winning smash hit returns with  !  In this Early Access, bring your toys back to life with  , and its two DLC's -   and  . Before full release, the original  ,   and  DLC will be reignited as you man the guns for control of the trench-filled battlefields of Europe. That's both   games and all DLC in one $45-value bundle!  One of the top 10 best-selling Xbox LIVE® Arcade games of all time,   is a unique, action-packed strategy-based game in which players command antique WWI toy soldiers vying for control of the trench-filled battlefields of Europe. Deploy an exciting arsenal such as tanks, cavalry, biplanes, and flamethrowers in vintage WWI toy dioramas. Position your defenses and take direct control of your artillery to bomb the enemy positions, pilot your bi-plane against the enemy trench, or maneuver your tanks across No-Man’s Land and lead your Toy Soldiers to victory!  Enjoy all new French inspired content with THE KAISER'S BATTLE! Enter the fray as the French Army and battle into the midnight hours in new multiplayer and Survival Mode maps. Take on the new experimental boss, the fearsome K-Wagen! The British are bringing brand new secret weapons of tiny toy mayhem in 'Invasion!,' the second add-on to Toy Soldiers from Signal Studios!  Put on your Kaiser’s helmet and command the German Army against a mad menagerie of new antagonistic toys, including flying saucers, chivalrous knights, and the “Rolls Royce of the Sky,” the WWII Mustang.  Defend Germany in a new Mini-campaign topped by the most calculating, head-strong boss of all (batteries not included)! Raise your saber, soldier, and lead the charge against… is that a spaceman? The Invasion has begun! The Cold War ignites when '80s era action toys come alive and wage war!  delivers hours of intense combat combined with addictive action strategy gameplay. Superpowers collide in this playful homage to '80s action toys and films. Command the powerful Cold War arsenals of the USA or USSR armies! Control base turrets, modern combat vehicles, fighter jets, attack helicopters, and commando action figures. Whether lighting up the Toy Box alone or jumping into the fray with your friends, battle in campaign, co-op, or competitive modes. Fight for the high score in the addictive mini-games, and while you're at it, don't forget to BLOW EVERYTHING UP! Its time to step into the boots of our Russian comrades and fight back as the Evil Empire! Deploy turrets, modern combat vehicles, attack helicopters and a slew of new tricks to destroy your capitalist foes—all while enjoying expanded single player, co-op, and competitive modes. Eager to return to your freedom-fighting American army? Turn up the heat and invade a harsh new world in the jungle-themed Napalm; the final expansion for Toy Soldiers: Cold War.  With challenges focused on torching your enemies, additional weapons at your disposal, a brand-new vehicle, and expanded single-player, co-op, and competitive modes, Napalm is sure to set a new standard for startling authenticity and intense action. "},
{"name": "DG2: Defense Grid 2", "url": "http://store.steampowered.com/app/221540", "price": 45.99, "windows": 1, "mac": 1, "hdd_space": 2048.0, "linux": 1, "release_date": "23 Sep, 2014", "id_software": 221540, "description": "Defense Grid 2, DG2, is the highly-anticipated sequel to Hidden Path Entertainment’s 2008 Defense Grid: The Awakening.  Setting the bar as the definitive tower defense game, Defense Grid 2 introduces new worlds and threats to test your tower placement strategies.  With a bold new look, a compelling single-player campaign, and the addition of new game modes, online player-versus-player and multiplayer co-op, every play-through brings fun new opportunities and challenges. DG2 comes with a story campaign featuring 21 stunning maps, dynamic level movement, an expanded story and cast of characters, hundreds of challenge mode experiences, new multiplayer modes, a procedurally driven audio score and the ability for players to build their own levels.  DG2 also introduces players to DG Architect, a level creation tool set connected to Steam Workshop where players can create their own unique levels to share and possibly even sell if selected. DG2 for the PC was funded in part by Dracogen, a private investor after a 2012 Kickstarter campaign funded the original game's DLC, Defense Grid: Containment. DG2 is developed by Hidden Path Entertainment and published by 505 Games. "},
{"name": "AI War: Fleet Command", "url": "http://store.steampowered.com/app/40400", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 300.0, "linux": 1, "release_date": "21 Oct, 2009", "id_software": 40400, "description": "\"You are outgunned. You are massively outnumbered. You must win.\" These are your orders. Humanity has already fought its war against the machines -- and lost. AI death squads stand watch over every planet and every wormhole, the few remaining human settlements are held captive in orbiting bubbles, and the AIs have turned their attention outward, away from the galaxy, to alien threats or opportunities unknown. This inattention is our only hope: a small resistance, too insignificant even to be noticed by the AI central command, has survived. These are the forces you will command. The AI subcommanders will fight you to the death when they see you -- but your glimmer of opportunity comes from quietly subduing those subcommanders without alerting central processing to the danger until it's too late. You do have a few things going in your favor. Your ships are much faster. You have safe AI routines to automate defenses and mining outposts. You have production techniques that can churn out fully-outfitted unmanned fighters in seconds. There will never be more than a few thousand of your ships versus tens of thousands of theirs, but through careful strategy you must somehow reach and destroy the heavily-guarded AI cores. Go forth into the galaxy, steal AI technology, recapture those planets you must in order to achieve your ends, and save what remains of humanity. But draw too much attention to yourself, and the full might of the AI overlords will come crashing down. "},
{"name": "Baldur's Gate II: Enhanced Edition", "url": "http://store.steampowered.com/app/257350", "price": 44.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "15 Nov, 2013", "id_software": 257350, "description": "Kidnapped. Imprisoned. Tortured. The wizard Irenicus holds you captive in his stronghold, attempting to strip you of the powers that are your birthright. Can you resist the evil within you, forge a legend of heroic proportions, and ultimately destroy the dark essence that haunts your dreams? Or will you embrace your monstrous nature, carve a swath of destruction across the realms, and ascend to godhood as the new Lord of Murder? Baldur's Gate II: Enhanced Edition brings this critically acclaimed role-playing experience to back to life. "},
{"name": "Wizardry 8", "url": "http://store.steampowered.com/app/245450", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 2048.0, "linux": 0, "release_date": "15 Nov, 2001", "id_software": 245450, "description": "A New Wizardry for a New Generation The universe is in the throes of violent upheaval and change. Vast and mysterious forces are preparing for the final confrontation. A small group of heroes from distant lands must plunge into the heart of the maelstrom, to uncover long-forgotten secrets, and bring about a new era. Should they succeed, they will gain the powers of the gods themselves. If they fail, countless worlds will fall into the grip of darkness. Wizardry 8 raises the standard for fantasy role-playing with a vengeance. Prepare yourself for a new level of excitement, immersiveness and depth that made role-playing games one of the best-selling, best-loved genres of all time. Prepare to experience the culmination of a prestigious RPG series. Enter a vast world of intrigue and wonder. Unravel a gripping, non-linear storyline. Battle your way to victory using your swords, your magic, and your wits. Compete with rivals or align with allies as you struggle to ascend to the Cosmic Circle. Take the battle to the dreaded Dark Savant in Wizardry 8, the phenomenal conclusion to the Dark Savant trilogy, one of the most extensive and challenging stories ever told in classic role-playing games!  This is the legacy of Wizardry 8! "},
{"name": "Awesomenauts", "url": "http://store.steampowered.com/app/204300", "price": 16.99, "windows": 1, "mac": 1, "hdd_space": 2048.0, "linux": 1, "release_date": "1 Aug, 2012", "id_software": 204300, "description": "The year is 3587. Conflict spans the stars as huge robot armies are locked in an enduring stalemate. In their bid for galactic supremacy, they call upon the most powerful group of mercenaries in the universe: the Awesomenauts! Awesomenauts is a MOBA fitted into the form of an accessible 3-on-3 action platformer. Head out to the online battlefields together with your friends as an online party or in local splitscreen, and never worry about having to wait for an online match because of drop-in matchmaking! Devise strategies as you upgrade and customize each character's skills to suit your playing style. Expect new items, features, DLC and Awesomenauts to be added regularly! "},
{"name": "Dragon Age: Origins", "url": "http://store.steampowered.com/app/17450", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 20480.0, "linux": 0, "release_date": "6 Nov, 2009", "id_software": 17450, "description": "You are a Grey Warden, one of the last of a legendary order of guardians. With the return of an ancient foe and the kingdom engulfed in civil war, you have been chosen by fate to unite the shattered lands and slay the archdemon once and for all.   Blood Dragon Armor Commissioned by an infamous Nevarran dragon hunter, this armor was crafted in a time when dragons had almost been hunted to extinction. Infused with their blood, the armor gained notoriety after the hunter died at the hands of men rather than the dragons it was designed to protect him from.   The Stone Prisoner The darkspawn-infested village of Honnleath holds a secret: the forgotten stone figure at the town’s heart is a powerful golem frozen in time. Free the creature and reveal a storied quest to unlock its power and mysterious past. Download The Stone Prisoner and gain access to Shale, a mighty stone golem who can join the party and travel throughout Dragon Age: Origins. One of the most powerful characters in the game, Shale comes with a rich back story, extensive voice acting, and a unique follower quest to explore. The Stone Prisoner also includes new environments, items, and hours of additional gameplay that adds to the Dragon Age: Origins campaign. "},
{"name": "Godus", "url": "http://store.steampowered.com/app/232810", "price": 36.99, "windows": 1, "mac": 1, "hdd_space": 1024.0, "linux": 0, "release_date": "13 Sep, 2013", "id_software": 232810, "description": "Have you ever wanted to play god? In GODUS, you can sculpt every inch of a beautiful world that you look down upon, where your population of Followers will settle and multiply. As you rule over your living, breathing society, a civilization will blossom across your land and offer you their belief. The more Followers that believe in you, the more powerful you will become. It is as simple to play as it is spectacular to behold. Come and lead an incredible journey - this delightful, charming world is waiting for you to make it your own. GODUS is currently in active cross-platform development for Windows PC, Mac OS and mobile devices where the gameplay experience will evolve and expand over time as we periodically deliver updates for the game. GODUS is brought to you by legendary designer and inventor of the god game genre, Peter Molyneux. "},
{"name": "Space Engineers", "url": "http://store.steampowered.com/app/244850", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "23 Oct, 2013", "id_software": 244850, "description": "Space Engineers is a sandbox game about engineering, construction and maintenance of space works. Players build space ships and space stations of various sizes and utilization (civil and military), pilot ships and perform asteroid mining. Space Engineers utilizes a realistic volumetric-based physics engine: all objects can be assembled, disassembled, damaged and destroyed. The game comes with two game modes: creative and survival. Volumetric objects are structures composed from block-like modules interlocked in a grid. Volumetric objects behave like real physical objects with mass, inertia and velocity. Individual modules have real volume and storage capacity. Space Engineers is inspired by reality and by how things work. Think about modern-day NASA technology extrapolated 60 years into the future. Space Engineers strives to follow the laws of physics and doesn't use technologies that wouldn't be feasible in the near future. Space Engineers concentrates on construction aspects, but can be played as a tactical shooter as well. We expect players to avoid engaging in direct man-to-man combat and instead use their creativity and engineering skills to build war machines and fortifications. Space Engineers shouldn’t be about troops; it should be about the machinery you build. Please be sure to read the list of current features before you buy the game. It will give you an insight on what is or isn't actually working:  Start by watching this video tutorial: Space Engineers is in development and undergoing frequent optimizations. The performance will get better. The performance depends on the complexity of your world and the configuration of your computer. Simple worlds run smoothly even on low-end computers, but a more complex world with rich object interactions could overload even high-end computers. Please read our performance advices:  Minimum requirements represent the bare minimum to run simple scenes and don’t guarantee a perfect experience. "},
{"name": "TUG", "url": "http://store.steampowered.com/app/277930", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 10240.0, "linux": 0, "release_date": "28 Mar, 2014", "id_software": 277930, "description": "TUG sits at the crossroads where survival sandbox and multiplayer RPGs meet, offering both elegant simplicity and a world of complex secrets for those who desire to seek them out. The gameplay focuses on crafting, exploration, pvp, and role-playing, with an emphasis on immersion and player freedom. Begin your journey as a Seedling, a race of humanoid beings with special crystals on their hands enabling them to interface with the strange energies and ancient secrets in the world around them. TUG offers a massive procedurally-generated world to explore, full of mystery and danger. How will you and your friends harness these powerful tools to build a new world? We currently offer 3 game modes in our current alpha state. Currently, survival mode is our main development focus and we will be adding a lot of content and features in the upcoming months. We want TUG to immerse you in it’s world. We are dedicated to bringing you that experience even if we have to build an engine from the ground up. These features have been updated into our game for you to play and provide feedback since our launch on Early Access. We will continue to improve these current features and implement new ones. TUG have been in development for over a year and we realize that building our own game engine takes up a lot of time. We wish to implement these features before we launch TUG early next year in 2015. We decided to release this early because your feedback, ideas, and thoughts means everything to us in this early stage. We wouldn't be here without the community so please get involve and let us know how we can make TUG fun for you. We are committed to launching gameplay updates every 4-6 weeks and hotfix patches occasionally. We are a team of game designers, artists, programmers, and academic scientists--the game is intended to serve as a platform for social science research of player interactions within virtual worlds. This ongoing research will be used to continuously improve the game, as well as further our academic understanding of how people interact in online spaces. TUG is an experiment in collaborative game design. "},
{"name": "The Cave", "url": "http://store.steampowered.com/app/221810", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 5120.0, "linux": 1, "release_date": "23 Jan, 2013", "id_software": 221810, "description": "The Cave is a new adventure game from Monkey Island and Maniac Mansion creator Ron Gilbert, and Double Fine Productions, the award-winning studio behind Psychonauts and Brütal Legend. Assemble your team of three from seven unlikely adventurers, each with their own unique personalities and stories, then descend into the mysterious depths to explore locations including a subterranean amusement park and a medieval castle, not to mention a fully armed and ready-to-launch nuclear tipped ICBM. The Cave awaits. "},
{"name": "Capsized", "url": "http://store.steampowered.com/app/95300", "price": 16.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 1, "release_date": "29 Apr, 2011", "id_software": 95300, "description": " is a fast paced 2D platformer focused on intense action and exploration. As a intrepid space traveler, your ship has crash landed on a mysterious alien planet. You must navigate through the perilous environment and fight off blood-thirsty creatures to save your crewmates and escape with your lives! Artist Jesse McGibney and programmer Lee Vermeulen create an immersive alien world teeming with bizarre life-forms and strange landscapes presented in a unique hand-drawn art style. Combining control elements of first person shooters and innovative physics based combat, Capsized emphasizes action without giving up the smart problem solving of classic platform games. Use your jetpack to fly through the alien jungle, and tools such as the Gravity Hook to manipulate your environment to skilfully dodge and defeat attacking enemies. You will be challenged - with platforming, puzzle solving, and deadly skirmishing, often all at the same time! "},
{"name": "Bloody Trapland", "url": "http://store.steampowered.com/app/257750", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 500.0, "linux": 0, "release_date": "27 Oct, 2013", "id_software": 257750, "description": "Bloody Trapland is a fast-paced multiplayer platformer where the levels are filled with dozens of dangerous traps and tricky jumps that stand in your way! Play co-op with your friends or take on the challenges on your own. With support for up to 4 players at once, local and/or online. This is a challenging, yet simple game that anyone can enjoy, whether you're a casual or a hardcore gamer. "},
{"name": "METAL SLUG 3", "url": "http://store.steampowered.com/app/250180", "price": 14.99, "windows": 1, "mac": 0, "hdd_space": 500.0, "linux": 0, "release_date": "14 Feb, 2014", "id_software": 250180, "description": ", the masterpiece in SNK’s emblematic 2D run & gun action shooting game series, still continues to fascinate millions of fans worldwide to this day for its intricate dot-pixel graphics, and simple and intuitive game controls! The most highly praised title in the series among Metal Slug fans for its refined balance and game volume, heads out to the Steam gaming platform! Play the arcade version of    from the beginning, and explore 5 immense challenging stages featuring multiple branching paths to explore exciting new areas! Make your way through the deluge of fire and fight off gigantic boss characters! Play your favorite stages at will and train alone or with a brother-in-arms on the missions you have unlocked so far! Connect to Steam and clear missions with friends far away via Online Co-Op Play. Find a fellow countryman or foreign ally and let the mission begin! Configure display, control, and language settings. View original illustrations of the game that you've unlocked. Check your current rank and score in  at any time, and compete with other players to become the world's No. 1 soldier! "}][[[[[[[[[[[[{"name": "Counter-Strike", "url": "http://store.steampowered.com/app/10", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 1, "release_date": "1 Nov, 2000", "id_software": 10, "description": "Play the world's number 1 online action game. Engage in an incredibly realistic brand of terrorist warfare in this wildly popular team-based game. Ally with teammates to complete strategic missions. Take out enemy sites. Rescue hostages. Your role affects your team's success. Your team's success affects your role. "},
{"name": "Counter-Strike: Global Offensive", "url": "http://store.steampowered.com/app/730", "price": 24.99, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 1, "release_date": "21 Aug, 2012", "id_software": 730, "description": "Counter-Strike: Global Offensive (CS: GO) will expand upon the team-based action gameplay that it pioneered when it was launched 12 years ago. CS: GO features new maps, characters, and weapons and delivers updated versions of the classic CS content (de_dust, etc.). In addition, CS: GO will introduce new gameplay modes, matchmaking, leader boards, and more. \"Counter-Strike took the gaming industry by surprise when the unlikely MOD became the most played online PC action game in the world almost immediately after its release in August 1999,\" said Doug Lombardi at Valve. \"For the past 12 years, it has continued to be one of the most-played games in the world, headline competitive gaming tournaments and selling over 25 million units worldwide across the franchise. CS: GO promises to expand on CS' award-winning gameplay and deliver it to gamers on the PC as well as the next gen consoles and the Mac.\" "},
{"name": "Team Fortress 2", "url": "http://store.steampowered.com/app/440", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 15360.0, "linux": 1, "release_date": "10 Oct, 2007", "id_software": 440, "description": ""},
{"name": "Counter-Strike: Source", "url": "http://store.steampowered.com/app/240", "price": 36.99, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 1, "release_date": "1 Nov, 2004", "id_software": 240, "description": "THE NEXT INSTALLMENT OF THE WORLD'S # 1 ONLINE ACTION GAME  Counter-Strike: Source blends Counter-Strike's award-winning teamplay action with the advanced technology of Source™ technology. Featuring state of the art graphics, all new sounds, and introducing physics, Counter-Strike: Source is a must-have for every action gamer. "},
{"name": "Day of Defeat: Source", "url": "http://store.steampowered.com/app/300", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 0, "release_date": "12 Jul, 2010", "id_software": 300, "description": "Day of Defeat offers intense online action gameplay set in Europe during WWII. Assume the role of infantry, sniper or machine-gunner classes, and more. DoD:S features enhanced graphics and sounds design to leverage the power of Source, Valve's new engine technology. "},
{"name": "Red Orchestra 2: Heroes of Stalingrad with Rising Storm", "url": "http://store.steampowered.com/app/35450", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "13 Sep, 2011", "id_software": 35450, "description": "Red Orchestra 2: Heroes of Stalingrad, the leading tactical multiplayer WWII shooter on the PC, will take the award winning Red Orchestra franchise into the next generation of gaming. Cutting edge graphics and audio built using the Unreal Engine 3, inventive features and streamlined realism will deliver an unrivalled tactical shooter experience.   Heroes of Stalingrad will focus on the Battle of Stalingrad and the surrounding operations, both German and Russian, from July 1942 to February 1943. The game allows the player to experience one of the most brutal battles in all of human history. Delivering unrivalled accuracy and attention to detail, along with gritty, vicious combat in multiplayer and single-player modes the game will feature everything from quick, brutal firefights to more intricate and challenging tactical modes. "},
{"name": "Insurgency", "url": "http://store.steampowered.com/app/222880", "price": 27.99, "windows": 1, "mac": 1, "hdd_space": 6144.0, "linux": 0, "release_date": "22 Jan, 2014", "id_software": 222880, "description": "Take to the streets for intense close quarters combat, where a team's survival depends upon securing crucial strongholds and destroying enemy supply in this multiplayer and cooperative Source Engine based experience. The follow-up game to the award-winning Source mod,   is highly competitive and unforgivingly lethal, striking a balance between one-life gameplay and prolonged action.  --- Three territorial objectives must be captured by the attacking team in sequential order. For each objective captured, they gain more reinforcement and time to attack the next. Defenders have a finite amount of reinforcements and must use each wisely. Once the third objective is captured by the attackers, a fourth cache objective must be destroyed, while the defenders have only one life to make a last stand.  --- Three territorial objectives, one for each team, plus one neutral. Each team only respawns when they secure an objective. Secure all objectives or eliminate all enemy to win. Every life counts, making this a very suspenseful experience dependent upon teamwork.  --- In addition to three territorial objectives, each team has a supply cache to protect. Teams gain extra reinforcement waves until their cache is destroyed. When both teams have lost their caches and all reinforcement waves, it becomes a Firefight match.  --- There is one central territorial objective in the area. The team that controls it does not deplete reinforcement waves. This gameplay in this mode is reminiscent to King of the Hill or \"tug of war\".  --- A high value target (\"HVT\") must be escorted to an extraction point. It's one team's goal to make this happen and it's the other team's goal to stop this from happening at all costs. The HVT is only armed with a silenced pistol, but can pick up a weapon from a fallen enemy or teammate.  --- In this attack and defend mode a weapon cache must be discovered and destroyed. There are three potential locations for the cache that the attacking team must get eyes on. The defending team must set up a strong defense, and perhaps even make use of a diversion to fool the attacking team into thinking the cache is somewhere that it's not.  --- The standard Capture the Flag mode, but with a twist. Your team's goal is to take the enemy's intel and return it to your base. Your team will only gain reinforcements when someone takes the enemy's intel, or when an enemy stealing your team's intel is neutralized. This mode requires very strong team coordination and strategy.  --- One neutral territorial objective and two caches on each side. The goal is to secure the entire area, controlling the middle and destroying the enemy's caches. Your team respawns when they secure the territorial objective or destroy a cache objective.  --- Complete mission-based objectives in sequence against AI enemy. Each successful objective will respawn anyone who was eliminated along the way.  --- Insurgents are dispersed in the environment, and your squad must eliminate all targets while locating and destroying the weapons cache. High on tension, with only one-life. "},
{"name": "Natural Selection 2", "url": "http://store.steampowered.com/app/4920", "price": 45.99, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "30 Oct, 2012", "id_software": 4920, "description": "Natural Selection 2 is an immersive, multiplayer shooter that pits aliens against humans in a strategic and action-packed struggle for survival. It seamlessly combines shooter and RTS/strategy gameplay. "},
{"name": "Dota 2", "url": "http://store.steampowered.com/app/570", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 1, "release_date": "9 Jul, 2013", "id_software": 570, "description": "Dota is a competitive game of action and strategy, played both professionally and casually by millions of passionate fans worldwide. Players pick from a pool of over a hundred heroes, forming two teams of five players. Radiant heroes then battle their Dire counterparts to control a gorgeous fantasy landscape, waging campaigns of cunning, stealth, and outright warfare. Irresistibly colorful on the surface, Dota is a game of infinite depth and complexity. Every hero has an array of skills and abilities that combine with the skills of their allies in unexpected ways, to ensure that no game is ever remotely alike. This is one of the reasons that the Dota phenomenon has continued to grow. Originating as a fan-made Warcraft 3 modification, Dota was an instant underground hit. After coming to Valve, the original community developers have bridged the gap to a more inclusive audience, so that the rest of the world can experience the same core gameplay, but with the level of polish that only Valve can provide. Get a taste of the game that has enthralled millions. "},
{"name": "BrainBread", "url": "http://store.steampowered.com/app/90006", "price": 0.0, "windows": 0, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "1 Sep, 2004", "id_software": 90006, "description": ""},
{"name": "Zombie Panic", "url": "http://store.steampowered.com/app/90044", "price": 0.0, "windows": 0, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "31 Oct, 2004", "id_software": 90044, "description": ""},
{"name": "Half-Life: Before", "url": "http://store.steampowered.com/app/261980", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 4096.0, "linux": 0, "release_date": "5 Mar, 2009", "id_software": 261980, "description": "Half-Life: Before – is a modification for Half-Life with new levels and story. Mod is based on Spirit of Half-Life 1.8 technology, that increases visual and functional component of the mod. You're playing as a Black Mesa scientist Andrew Winner. Your mission is to enter another world to find an artifact that will allow Black Mesa scientists to open portal in another world. "},
{"name": "Heroes & Generals", "url": "http://store.steampowered.com/app/227940", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "11 Jul, 2014", "id_software": 227940, "description": " is a Free2Play Massive Online FPS with a Strategic Multiplayer Campaign, set in the midst of World War II Europe, where Axis and Allies fight for control. The game uniquely merges epic first-person shooter action with a rich strategic layer, where your decisions have the power to turn the tide in an ongoing war among thousands of online players. Players can choose to play as 'Heroes', fighting in the trenches, flying planes, commanding tanks and other vehicles on the battlefield, or take control of the war as 'Generals', determining the strategic direction and supporting fellow players by managing battlefield assets, army units and reinforcements. The 'Generals' part of the game is also playable via the companion app ' ' which is available for iOS and Android. As Infantry, Tank Gunner, Fighter Pilot, Recon, Paratrooper or General, your actions can turn the tide of a persistent online war, fought by players across the world!  Wars Aren’t Won By Tanks Alone! "},
{"name": "Men of War: Assault Squad", "url": "http://store.steampowered.com/app/64000", "price": 6.24, "windows": 1, "mac": 0, "hdd_space": 4096.0, "linux": 0, "release_date": "24 Feb, 2011", "id_software": 64000, "description": "Men of War: Assault Squad features a completely new cooperative skirmish game mode with access to five different nations (Russia, Germany, USA, Commonwealth and, for the first time ever in the Men of War series, Japan) as well as increased realism and accessibility. Players can get behind the controls of a tank to smash through obstacles, crush soldiers under their tracks and fire high-explosive shells at enemy emplacements, they can even take control of individual soldiers as they fight.  As in previous games in the series, Men of War: Assault Squad includes the unique \"direct control\" feature which enables players to be in command of any unit using the WASD controls, rather than pointing and clicking. "},
{"name": "War Thunder", "url": "http://store.steampowered.com/app/236390", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 0, "release_date": "15 Aug, 2013", "id_software": 236390, "description": " is a next generation MMO combat game dedicated to World War II military aviation, armored vehicles, and fleets. You will take part in all of the major combat battles, fighting with real players all over the world.  offers a highly detailed and personalized aviation experience, giving players access to hundreds models of planes with detailed cockpits, dozens of upgradeable weapons, and flying skills that can be honed and improved with each mission. Thanks to the game’s painstaking attention to detail, you’ll truly feel like a World War II fighter pilot as you plunge into battle. The genuine World War II experience isn’t limited to the skies. The massive historical battles featured in War Thunder cannot be fought by aviation alone, so the game will also expose players to combat on land and at sea. Currently the game is in open beta stage and full functionality is yet to come. "},
{"name": "Red Orchestra: Ostfront 41-45", "url": "http://store.steampowered.com/app/1200", "price": 16.99, "windows": 1, "mac": 1, "hdd_space": 2048.0, "linux": 1, "release_date": "14 Mar, 2006", "id_software": 1200, "description": ""},
{"name": "Call of Duty: World at War", "url": "http://store.steampowered.com/app/10090", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "18 Nov, 2008", "id_software": 10090, "description": "Call of Duty is back, redefining war like you've never experienced before. Building on the Call of Duty 4®: Modern Warfare engine, Call of Duty: World at War immerses players into the most gritty and chaotic WWII combat ever experienced. Players band together to survive the most harrowing and climactic battles that led to the demise of the Axis powers on the European and Pacific fronts. The title offers an uncensored experience with unique enemies and combat variety, including Kamikaze fighters, ambush attacks, Banzai charges and cunning cover tactics, as well as explosive on-screen action through the all new four-player cooperative campaign. The addictive competitive multiplayer has also been enhanced with new infantry and vehicle-based action, a higher level cap, more weapons, and a host of new Perks, maps and challenges.                     "},
{"name": "Star Trek Online", "url": "http://store.steampowered.com/app/9900", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 10240.0, "linux": 0, "release_date": "2 Feb, 2010", "id_software": 9900, "description": "In Star Trek Online, the Star Trek universe appears for the first time on a truly massive scale. Players take the captain's chair as they command their own starship and crew. Explore strange new worlds, seek out new life and new civilizations, and boldly go where no one has gone before in this ever-expanding online universe. Join us in Star Trek Online, and boldly go where no one has gone before! "},
{"name": "Dead Island: Epidemic", "url": "http://store.steampowered.com/app/222900", "price": 31.99, "windows": 1, "mac": 0, "hdd_space": 3072.0, "linux": 0, "release_date": "", "id_software": 222900, "description": "Dead Island: Epidemic is a fast-paced action game where players will duke it out over supply points, using an arsenal of crafted weaponry, a bevy of devastating powers, and good old-fashioned teamwork. You have direct control over your hero. No Last Hitting, mouse-click-to-move nonsense here -  , and your trigger finger, making it easy to hop in, no muss, no fuss. No idea what any of that means? No problem. All you need to know is that you need to point your crosshairs towards anyone and anything not on your team! Team up with 3 other survivors and take on the zombie menace together in  , or take the fight to other players in the   where you'll battle it out in a competition to grab supplies, hold key points, outsmart the competition and blast through hordes of zombies.  Featuring a constantly expanding and varied roster of unlikely heroes with unique skills, Dead Island Epidemic offers you a  whether you like your action up close and personal, at range or through supporting your teammates. Each character has an  - use these strategically in order to inflict maximum punishment on both the undead and those you want to be dead.  is here from Dead Island, helping you get the edge (pun intended) on the competition and build an arsenal from  ! Featuring progressively more powerful and insane weapons in multiple tiers: From crudely crafted Spikey Planks to Electrified Double Spinning Sawblade Swords and literally everything in between: what’s better than a chainsaw for dispatching the undead horde? Well, how about a  ? Everyone knows machetes are cool, but   are better!  Whatever your chosen character, style of play and mental disposition - there’s a weapon for every occasion. "},
{"name": "Firefall", "url": "http://store.steampowered.com/app/227700", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 20480.0, "linux": 0, "release_date": "29 Jul, 2014", "id_software": 227700, "description": "Fundamentally built to be a completely Free-to-Play AAA MMO Shooter, Firefall delivers an engaging gameplay experience like no other.  With a constantly changing world, deep narrative, endless customization, and rewarding player progression, Firefall will consistently deliver spectacular content that will please both PvE and PvP players.  \"I grow tired of watching my friends die in battle day after day.  The Chosen have claimed more of us than we have of them, and the Melding consumes more of our planet by the minute.  This is still our home, our planet, and we want it back.  Join us and help us fight this dreaded war, because  \"  - Unknown ARES Pilot on the frontlines. •Explore a vast, evolving open world with dynamic content that responds to player interactions. •Discover the lore of Firefall through episodic narrative.  •Combat your enemies in a skill based shooter in either first or third person view.  •Engage dynamic Missions and Events, including epic Titan Battles.  •Upgrade your Battleframe with limitless crafting, loot, and progression. •Outfit your character with endless customization options. Explore a vast open world from New Eden to Devil’s Tusk.  Become an elite ARES pilot and be prepared to fight an array of creatures as well as confront the Chosen.   Don a variety of Battleframes and destroy your enemies from either a first or third person viewpoint.   Combat the Chosen to reclaim earth and become the best ARES pilot in your class.  With familiar and highly polished shooting mechanics, your skill and dedication will be rewarded.  Firefall is action packed with rewarding content, including massive Titan Battles for PvE and skill-based open world PvP.   Firefall is the first AAA Free-to-Play MMO Shooter.  Outfitted with military-grade battleframes, players will be able to collect equipment and materials to customize and strengthen their arsenal of weapons and abilities, while experiencing Firefall’s rich lore and engaging content.  With epic loot to be unearthed and rewarding level progression to be achieved, the possibilities in Firefall are limitless. "},
{"name": "March of War", "url": "http://store.steampowered.com/app/234310", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 2048.0, "linux": 0, "release_date": "10 Jun, 2014", "id_software": 234310, "description": "The year is 1947. The world lies ravaged by war. Align yourself with one of six warring factions and fight for global domination in a world where borders rapidly shift as battles are won and lost. This is  . An online turn-based strategy game set in a dieselpunk world where strategy and firepower rule the day. Take command and lead your army into 3D battlefields that allow you to assess the war-zone from every angle. Deploy a wide range of vehicles, infantry and artillery where their specific weapons can be most effective. Destroy your enemies and capture their territory to advance through the ranks of your faction. Rise high enough and you’ll have the honour of joining your faction’s High Command, or perhaps even be voted Faction Leader. Achieving High Command or Faction Leader status expands the game into an intricate web of political allegiances and betrayals, where your decisions directly influence the course of the war as you strive to lead your faction to global domination. "},
{"name": "America's Army: Proving Grounds Beta", "url": "http://store.steampowered.com/app/203290", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 10000.0, "linux": 0, "release_date": "29 Aug, 2013", "id_software": 203290, "description": ""},
{"name": "Tactical Intervention", "url": "http://store.steampowered.com/app/51100", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 0, "release_date": "8 Oct, 2013", "id_software": 51100, "description": "Tactical Intervention is a Free to Play tactical FPS with unique mechanics. Drive, bomb, rappel and shoot your way through eleven high octane levels. Command attack dogs, deploy breaching charges, perform drive-bys and control hostage situations! From the brilliant mind of Minh “Gooseman” Le, the co-creator of the seminal team-based FPS Counter-Strike, comes its spiritual successor, Tactical Intervention. Take your role as either terrorist or counter-terrorist and confront opponents in fierce and frantic combat over a variety of high energy maps wielding authentic real world weapons, from the classic P90 to the terrorist favourite, the AK47. Featuring unique games modes and mechanics not seen in other shooters, Tactical Intervention allows you to experience first person combat from an entirely new perspective. Hijack a car to take part in an intense highway chase; unload your high-powered Gabard shotgun at the VIP while leaning out the window, as your opponents scramble to protect him. Take out the covering helicopter with a well-placed shot from an RPG while you handbrake turn to broadside your target. Experience the thrill of rappelling down a building, kicking in the plexiglass, hurling a flash bang, grabbing a hostage as a human shield, and dealing some rapid fire death with your Uzi. Use riot shields to defend yourself against enemy forces and then command your vicious German Shepard attack dog to savage terrorists out of line of sight. Dive to cover and lay down suppressing fire with your Aug assault rifle so your teammates can liberate the terrified hostages. Combining the strategic elements of modern team-based shooters with the pure thrill of the original Counter Strike series, Tactical Intervention brings a whole new level of gaming to the battlefield and lets players feel the true intensity of battle. With a huge variety of weapons, special equips, authentic combat uniforms and paths to victory, Tactical Intervention truly is the next evolution in team-based combat. So grab your P90, slap on a red-dot, twist in a silencer and dive into TI! "},
{"name": "Heroes & Generals - Ultimate Heroes & Generals Pack (German faction)", "url": "http://store.steampowered.com/app/323936", "price": 229.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 323936, "description": "This pack enables you to get the full Heroes & Generals experience, where you can play all roles as Heroes on the battlefields AND command Assault Teams as a General without first having to spend hours, weeks and even months of playtime to progress your characters and unlock weapons, equipment and vehicles. You will get an Infantryman fully equipped to take on the most demanding missions on foot; a Tank Crewman with a tank destroyer and a selection of tanks to crush the enemy forces; a Fighter Pilot with a fighter plane to dominate the skies; a Recon soldier with a scoped sniper rifle and a reconnaissance vehicle to take out enemies from a distance; a Paratrooper with a specialist weapon ready to drop down behind enemy lines; a General ready to command Assault Teams, a huge amount of gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbonpoints-, credits- and warfunds-earnings for a whole year. "},
{"name": "Heroes & Generals - Ultimate Heroes & Generals Pack (US faction)", "url": "http://store.steampowered.com/app/323935", "price": 229.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 323935, "description": "This pack enables you to get the full Heroes & Generals experience, where you can play all roles as Heroes on the battlefields AND command Assault Teams as a General without first having to spend hours, weeks and even months of playtime to progress your characters and unlock weapons, equipment and vehicles. You will get an Infantryman fully equipped to take on the most demanding missions on foot; a Tank Crewman with a tank destroyer and a selection of tanks to crush the enemy forces; a Fighter Pilot with a fighter plane to dominate the skies; a Recon soldier with a scoped sniper rifle and a reconnaissance vehicle to take out enemies from a distance; a Paratrooper with a specialist weapon ready to drop down behind enemy lines; a General ready to command Assault Teams, a huge amount of gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbonpoints-, credits- and warfunds-earnings for a whole year. "},
{"name": "Heroes & Generals - All Heroes Pack (German faction)", "url": "http://store.steampowered.com/app/323934", "price": 149.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 323934, "description": "If you wish to be able to play all roles on the battlefields and don’t want to play for weeks or months to unlock all the Heroes and their weapons, equipment and vehicles, then this pack is for you as it gives you 5 characters with loads of weapons, gear, vehicles and more. An Infantryman fully equipped to take on the most demanding missions on foot; a Tank Crewman with a tank destroyer and a selection of tanks to crush the enemy forces; a Fighter Pilot with a fighter plane to dominate the skies; a Recon soldier with a scoped sniper rifle and a reconnaissance vehicle to take out enemies from a distance; a Paratrooper with a specialist weapon ready to drop down behind enemy lines; a substantial amount of gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbonpoints-, credits- and warfunds-earnings for 90 days. "},
{"name": "Heroes & Generals - All Heroes Pack (US faction)", "url": "http://store.steampowered.com/app/323933", "price": 149.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 323933, "description": "If you wish to be able to play all roles on the battlefields and don’t want to play for weeks or months to unlock all the Heroes and their weapons, equipment and vehicles, then this pack is for you as it gives you 5 characters with loads of weapons, gear, vehicles and more. An Infantryman fully equipped to take on the most demanding missions on foot; a Tank Crewman with a tank destroyer and a selection of tanks to crush the enemy forces; a Fighter Pilot with a fighter plane to dominate the skies; a Recon soldier with a scoped sniper rifle and a reconnaissance vehicle to take out enemies from a distance; a Paratrooper with a specialist weapon ready to drop down behind enemy lines; a substantial amount of gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbonpoints-, credits- and warfunds-earnings for 90 days. "},
{"name": "Heroes & Generals - Tank Crew Starter Pack (German faction)", "url": "http://store.steampowered.com/app/323932", "price": 44.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 323932, "description": "If you wish to start a career as Tanker in Heroes & Generals, then this pack is for you. It gives you right away an Academy Trained Tank Crewman owning a selection of tanks and a tank destroyer ready to engage in armored warfare; a submachine gun and a handgun to customize your loadout for combat when outside the tanks; a wrench for repairing tanks; a good amount of gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbonpoints-, credits- and warfunds-earnings for two weeks. "},
{"name": "Heroes & Generals - Tank Crew Starter Pack (US faction)", "url": "http://store.steampowered.com/app/323931", "price": 44.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 323931, "description": "If you wish to start a career as Tanker in Heroes & Generals, then this pack is for you. It gives you right away an Academy Trained Tank Crewman owning a selection of tanks and a tank destroyer ready to engage in armored warfare; a submachine gun and a handgun to customize your loadout for combat when outside the tanks; a wrench for repairing tanks; a good amount of gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbonpoints-, credits- and warfunds-earnings for two weeks. "},
{"name": "Heroes & Generals - Infantry Rookie Pack (German faction)", "url": "http://store.steampowered.com/app/323930", "price": 29.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 323930, "description": "Enhance your Heroes & Generals experience with this great starter pack. It gives you an extra infantryman carrying carefully selected weapons to deal with mid-to-long range and close-quarter combat, as well as encounters with enemy tanks; an all terrain vehicle to help you and your teammates get faster around the huge maps; some gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbon points-, credits- and warfunds-earnings for a week. "},
{"name": "Heroes & Generals - Infantry Rookie Pack (US faction)", "url": "http://store.steampowered.com/app/311320", "price": 29.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "30 Sep, 2014", "id_software": 311320, "description": "Enhance your Heroes & Generals experience with this great starter pack. It gives you an extra infantryman carrying carefully selected weapons to deal with mid-to-long range and close-quarter combat, as well as encounters with enemy tanks; an all terrain vehicle to help you and your teammates get faster around the huge maps; some gold to allow for extra premium purchases and a Veteran Membership that boosts your XP-, ribbon points-, credits- and warfunds-earnings for a week. "},
{"name": "Dragon Nest Europe", "url": "http://store.steampowered.com/app/258700", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "Jan 2014", "id_software": 258700, "description": "Dive into blazingly fast combat action with visually stunning skills in a world caught in the wake of ancient dragons and waiting for the ancient Prophet to discover her powers. Immerse in an epic story with classic MMORPG and role-playing elements paired with a unique, console-like third-person perspective. No monotone “click and wait” or “turn-based” combat! Experience blazingly fast console quality action and thrilling combos for intense, non-stop action in a magical world.  Seven main classes with their own unique fighting style. Develop your character by individually specializing in more and more detailed combat skill trees.  Clear goals paired with intuitive, convenient controls encouraging a wide range of players to become fully engaged in the action and dive into the game.  A unique and balanced PvP system, harmonizing each challenger's gear with the enemy's one. Only the most skilled players will endure the fierce combats across many different modes and maps.  Venture through dozens of dungeons and challenging Nests with hundreds of quests.  No payments necessary, Dragon Nest is completely free to play. "},
{"name": "Champions Online: Free for All", "url": "http://store.steampowered.com/app/9880", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "1 Sep, 2009", "id_software": 9880, "description": " brings epic heroism back to the MMORPG genre with depth that challenges the most experienced online gamers, while its fast-paced action engages new entrants to the online superhero universe. Join Defender and the legendary Champions to stop Dr. Destroyer and his minions in the ultimate showdown between good and evil. "},
{"name": "Age Of Wushu", "url": "http://store.steampowered.com/app/265650", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 10240.0, "linux": 0, "release_date": "27 Mar, 2014", "id_software": 265650, "description": "Age of Wushu: Snail Games’ topnotch sandbox MMORPG that lets player become an aspiring Kung-Fu master and experience the captivating, oriental world of Ancient China. By combining revolutionary combat with beautiful renderings, players will master a variety of martial skills as they delve into a unique self-realization path to the pinnacle of power. Players are given tons of freedom unparalleled in modern MMORPGs in their journey to master the ancient Chinese martial arts, to delve into their character's unique story, to face the consequences of every action, and to fulfill their destiny. "},
{"name": "Operation Flashpoint: Dragon Rising", "url": "http://store.steampowered.com/app/12830", "price": 19.99, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "6 Oct, 2009", "id_software": 12830, "description": "Operation Flashpoint: Dragon Rising is a game about a fictitious conflict on one of the Sakhalin islands, a conflict that is in danger of erupting onto a global scale. The player takes the role of a US soldier, part of the allied force fighting against outnumbering Chinese forces vying for control of the island. The game centers on a campaign narrative that gives the player a variety of roles in the allied forces ranging from a Marine Infantry, tank commander, Special Forces and helicopter captain. The game has an incredible realistic depiction of war with careful attention to the detail of the weapons, equipment and tactics of the armed forces. The action is varied from intense fire fights through to slower pace tactical decision making on how to best tackle the mission objectives. "},
{"name": "Sid Meier's Civilization® V", "url": "http://store.steampowered.com/app/8930", "price": 44.99, "windows": 1, "mac": 1, "hdd_space": 8192.0, "linux": 1, "release_date": "23 Sep, 2010", "id_software": 8930, "description": "The Flagship Turn-Based Strategy Game Returns Become Ruler of the World by establishing and leading a civilization from the dawn of man into the space age: Wage war, conduct diplomacy, discover new technologies, go head-to-head with some of history’s greatest leaders and build the most powerful empire the world has ever known. *Modding SDK available post launch as a free download. † Charity selection available until Dec. 31, 2010. Not valid in all territories.  The Mac and Linux + SteamOS versions of Sid Meier's Civilization V are available in English, French, Italian, German and Spanish only. "},
{"name": "Sid Meier's Civilization®: Beyond Earth™", "url": "http://store.steampowered.com/app/65980", "price": 99.0, "windows": 1, "mac": 0, "hdd_space": 8192.0, "linux": 0, "release_date": "23 Oct, 2014", "id_software": 65980, "description": " is a new science-fiction-themed entry into the award-winning Civilization series. Set in the future, global events have destabilized the world leading to a collapse of modern society, a new world order and an uncertain future for humanity. As the human race struggles to recover, the re-developed nations focus their resources on deep space travel to chart a new beginning for mankind.  As part of an expedition sent to find a home beyond Earth, you will write the next chapter for humanity as you lead your people into a new frontier and create a new civilization in space. Explore and colonize an alien planet, research new technologies, amass mighty armies, build incredible Wonders and shape the face of your new world. As you embark on your journey you must make critical decisions. From your choice of sponsor and the make-up of your colony, to the ultimate path you choose for your civilization, every decision opens up new possibilities. "},
{"name": "Medieval II: Total War™", "url": "http://store.steampowered.com/app/4700", "price": 36.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "15 Nov, 2006", "id_software": 4700, "description": "Take command of your army and expand your reign in Medieval II - the fourth installment of the award-winning Total War series of strategy games. Direct massive battles featuring up to 10,000 bloodthirsty troops on epic 3D battlefields, while presiding over some of the greatest Medieval nations of the Western and Middle Eastern world. Spanning the most turbulent era in Western history, your quest for territory and power takes you through Europe, Africa, and the Middle East, and even onto the shores of the New World. You'll manage your empire with an iron fist, handling everything from building and improving cities to recruiting and training armies. Wield diplomacy to manipulate allies and enemies, outsmart the dreaded Inquisition, and influence the Pope. Lead the fight in the Crusades and bring victory to Islam or Christianity in the Holy War. Rewrite history and conquer the world. This is Total War! NOTE: Because the Kingdoms expansion uses core game elements from the Medieval II: Total War game, it is required that you use the same method for purchasing Kingdoms as you did in purchasing Medieval II: Total War. If you purchase Medieval II: Total War from Steam, then please use Steam to purchase Kingdoms. "},
{"name": "Gotham City Impostors Free to Play", "url": "http://store.steampowered.com/app/206210", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "30 Aug, 2012", "id_software": 206210, "description": "Hatched from the twisted minds at Monolith Productions, Gotham City Impostors is a download-only multiplayer FPS that pits violent vigilantes dressed up like Batman against craven criminals dressed up like the Joker in open warfare on the streets of Gotham City. "},
{"name": "Realm of the Mad God", "url": "http://store.steampowered.com/app/200210", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 100.0, "linux": 0, "release_date": "20 Feb, 2012", "id_software": 200210, "description": "  Team up with dozens of players and battle through the Realm of the Mad God, Oryx. With a retro 8-bit style, Realm is an evolution of traditional MMO gameplay. A dozen classes and hundreds of items to discover means Realm is easy to play but difficult to master. Players can jump in Realm for 5 minutes or stay online for hours because there is nothing to install or download. "},
{"name": "Marvel Heroes 2015", "url": "http://store.steampowered.com/app/226320", "price": 0.0, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 0, "release_date": "4 Jun, 2014", "id_software": 226320, "description": "Marvel Heroes 2015 is the Marvel MMO ARPG that you have been waiting for! Play as Iron Man, Star-Lord, Thor, Wolverine, Hulk, Spider-Man, Captain America and many more as they team up to try and stop Doctor Doom from devastating the world with the power of the Cosmic Cube. Marvel Heroes 2015 features a deep leveling system unique to each Super Hero, diverse locations set across the expansive Marvel Universe, a robust crafting system, action-packed player-versus-player (PvP) and much more. Marvel Heroes is a free-to-play Massively Multiplayer Action RPG for PC created by David Brevik, the visionary behind Diablo and Diablo 2 with an extensive original story crafted by Marvel super-scribe Brian Michael Bendis.  The story of Marvel Heroes 2015 is crafted by comic book super scribe Brian Michael Bendis (Ultimate Spider-Man, New Avengers, House of M, Secret Invasion, Avengers vs X-Men and many more).  The Cosmic Cube is a device of untold power capable of changing the very fabric of reality at the whim of its possessor. The brilliant but malevolent Dr. Doom has the Cube, and with it he aims to reshape the world in his own image. Determined to succeed where the Cube's previous wielders have failed, Doom has lined up villainous allies to prevent the super-heroes from interfering. Can you unravel Doctor Doom's sinister plan and stop him before it's too late? Marvel Heroes 2015 combines core gameplay elements of Diablo with the expansive library of characters from the Marvel Universe. "},
{"name": "Global Agenda: Free Agent", "url": "http://store.steampowered.com/app/17020", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 15360.0, "linux": 0, "release_date": "1 Feb, 2010", "id_software": 17020, "description": ""},
{"name": "Age of Empires II HD", "url": "http://store.steampowered.com/app/221380", "price": 36.99, "windows": 1, "mac": 0, "hdd_space": 2048.0, "linux": 0, "release_date": "9 Apr, 2013", "id_software": 221380, "description": "In Age of Empires II: HD Edition, fans of the original game and new players alike will fall in love with the classic Age of Empires II experience.  Explore all the original single player campaigns from both Age of Kings and The Conquerors expansion, choose from 18 civilizations spanning over a thousand years of history, and head online to challenge other Steam players in your quest for world domination throughout the ages.  Originally developed by Ensemble Studios and re-imagined in high definition by Hidden Path Entertainment, and Skybox Labs, Microsoft Studios is proud to bring Age of Empires II: HD Edition to Steam! "},
{"name": "Crusader Kings II", "url": "http://store.steampowered.com/app/203770", "price": 69.99, "windows": 1, "mac": 1, "hdd_space": 0.0, "linux": 1, "release_date": "14 Feb, 2012", "id_software": 203770, "description": "The Dark Ages might be drawing to a close, but Europe is still in turmoil. Petty lords vie against beleaguered kings who struggle to assert control over their fragmented realms. The Pope calls for a Crusade to protect the Christians in the Holy Land even as he refuses to relinquish control over the investiture of bishops - and their riches. Now is the time for greatness. Expand your demesne and secure the future of your dynasty. Fill your coffers, appoint vassals, root out traitors and heretics, introduce laws and interact with hundreds of nobles, each with their own agenda.  A good lord will always need friends to support him. But beware, as loyal vassals can quickly turn to bitter rivals, and some might not be as reliable as they seem...  Stand ready, and increase your prestige until the world whispers your name in awe. Do you have what it takes to become a Crusader King?  Crusader Kings II explores one of the defining periods in world history in an experience crafted by the masters of Grand Strategy. Medieval Europe is brought to life in this epic game of knights, schemes, and thrones... "},
{"name": "Stronghold Crusader 2", "url": "http://store.steampowered.com/app/232890", "price": 90.99, "windows": 1, "mac": 0, "hdd_space": 4096.0, "linux": 0, "release_date": "22 Sep, 2014", "id_software": 232890, "description": " is the long awaited sequel to Stronghold: Crusader, the original 'castle sim'. After 12 years Stronghold returns to the deserts of the Middle East circa 1189, with a new 3D engine and realistic castle destruction powered by Havok Physics. Crusader 2 will recapture the original game’s addictive, fast-paced gameplay and authentic castle simulation. True to its roots this new Stronghold will define old school real time strategy, combining RTS and city builder gameplay. Playing as a brutal Crusader Knight or Arabic freedom fighter, you must use a deadly array of troops and destructive siege equipment to decide the fate of the holy lands. Lead your forces into battle as either Richard the Lionheart or the Sultan of Syria in two historic single-player campaigns, with dynamic events such as tornados and locust swarms. Become the greatest Lord by managing your desert economy and seizing control of vital oases. To dominate the battlefield you will need to command more than 25 unique unit types, mastering their special abilities. Raise morale with the Sergeant at Arms, charge in with the Sassanid Knight, use Archers to launch an arrow volley or scale castle walls with the deadly Assassin. Once your skills have been perfected put them to the test in skirmish mode or take the battle online with up to eight human and AI players. Create teams, choose different AI opponents and design your own map in the ultimate skirmish or multiplayer game! "},
{"name": "CrimeCraft: GangWars", "url": "http://store.steampowered.com/app/38830", "price": 0.0, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "25 Aug, 2009", "id_software": 38830, "description": " is a massive expansion for the Free-to-Play Online Shooter CrimeCraft. GangWars revamps the experience for new users while also adding exciting end game content for veteran players. GangWars is set in the bloody aftermath of the Bleedout Campaign and the destruction of the Scorpion Chamber, the governing body of Sunrise City. Gangs now fight for control of the city. Build a gang and establish \"street cred\" for your crew based on individual and team achievements. Go to war against your opponents using a diverse arsenal of weapons, abilities and boosts. Capture all 20 unique combat zones and own it all, generating cash, bonuses and loot for your gang's dominance. "},
{"name": "Napoleon: Total War™", "url": "http://store.steampowered.com/app/34030", "price": 19.99, "windows": 1, "mac": 1, "hdd_space": 21504.0, "linux": 0, "release_date": "25 Feb, 2010", "id_software": 34030, "description": "History is as yet unwritten.  Napoleon: Total War™ is the new chapter in the critically acclaimed Total War™ series and opens up a new narrative layer to the genre-defining franchise. From the early Italian campaign to the battle of Waterloo, Napoleon covers two decades of relentless battles, a backdrop of a world in flames against which the story of an extraordinary military career unfolds.  Whether you play as the legendary general or against him, the outcome of war can never be guaranteed. The course of history relies on your ability to lead your troops through the most intense battles as never seen before in a Total War game.  "},
{"name": "Warhammer® 40,000: Dawn of War® - Soulstorm", "url": "http://store.steampowered.com/app/9450", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "5 Mar, 2008", "id_software": 9450, "description": " is the third and final expansion to the genre-defining and critically-acclaimed RTS, Dawn of War. In Soulstorm, two new armies are introduced, raising the total number of playable armies in Dawn of War to an unprecedented count of nine while also adding additional units to all existing factions. The revolutionary meta-game that was introduced in Dark Crusade is further expanded to an interplanetary scale, allowing players to battle across a star system.  Combined with its sister products, Soulstorm makes Dawn of War the largest and most detailed RTS ever released. "},
{"name": "Stronghold HD", "url": "http://store.steampowered.com/app/40950", "price": 11.99, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "19 Oct, 2001", "id_software": 40950, "description": "The original castle sim, Stronghold HD allows you to design, build and destroy historical castles. Engage in medieval warfare against the AI in one of two single player campaigns or online with up to 8 players. With 21 missions to test your mettle and four renegade lords to defeat, it is up to you to reunite medieval England and take back your lands from the treacherous Rat, Pig, Snake and Wolf. Missions range from breaking sieges and capturing enemy castles to raising gold and holding off enemy attacks. Also featured is a full economic campaign, tasking players to gather resources and build weapons within the time limit. With new high resolution graphics you have more control over your soldiers than ever before. The new HD battlefield view allows you to zoom out and play in real-time, with the whole map on one screen. Advance on the castle gates while flanking the enemy from behind, feign retreat and lead your foe into a deadly trap or just sit back and watch the destruction unfold. "},
{"name": "Warhammer® 40,000: Dawn of War® - Game of the Year Edition", "url": "http://store.steampowered.com/app/4570", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 0.0, "linux": 0, "release_date": "1 Jan, 2006", "id_software": 4570, "description": "The Game of the Year Edition features eight additional maps, additional online modes, and all the patches previously released online. Warhammer 40,000: Dawn of War builds upon the most exciting, visceral, front-line battlefield ever seen in an RTS game. Dawn of War Game of the Year features:  "},
{"name": "Command & Conquer: Red Alert 3", "url": "http://store.steampowered.com/app/17480", "price": 34.99, "windows": 1, "mac": 0, "hdd_space": 10240.0, "linux": 0, "release_date": "28 Oct, 2008", "id_software": 17480, "description": "The desperate leadership of a doomed Soviet Union travels back in time to change history and restore the glory of Mother Russia. The time travel mission goes awry, creating an alternate timeline where technology has followed an entirely different evolution, a new superpower has been thrust on to the world stage, and World War III is raging. The Empire of the Rising Sun has risen in the East, making World War III a three-way struggle between the Soviets, the Allies, and the Empire with armies fielding wacky and wonderful weapons and technologies like Tesla coils, heavily armed War Blimps, teleportation, armored bears, intelligent dolphins, floating island fortresses, and transforming tanks.       "},
{"name": "Life is Feudal: Your Own", "url": "http://store.steampowered.com/app/290080", "price": 72.99, "windows": 1, "mac": 0, "hdd_space": 5120.0, "linux": 0, "release_date": "19 Sep, 2014", "id_software": 290080, "description": " (LiF:YO) is a game set in a realistic medieval world with free terraforming and free building features. You can build your own house anywhere in the world! Team up with your friends and build a village or city and repel attacks by other players who want to steal your lands and slaughter your cattle! A good castle with a moat and tall city walls might help you protect yourselves and your precious cattle. The combat system in our game is quite unique. It is a no target and physics-based combat system. The direction of your attack depends on mouse movement. Basic movements combined with directional attacks can be mixed together into deadly combos with special effects. Battle formations are a new way to collaborate and control the situation on the battlefield with your fighting team. Depending on the battle situation, a group leader must issue the right commands to manage formations during a battle. The more group members that make up a given formation the bigger the advantages they enjoy. A well organised group will always prevail over a bunch of chickens with their heads cut off. True use of sandbox mechanics and not just the \"sandbox\" label being applied to the game. A great example is that player skill progression is not limited by artificial classes or roles. The Skill cap and Stat cap systems allow you to design a character which fits your style of play perfectly. The crafting system contains a lot of sand and boxes too. :) An excellent example is how alchemy works almost the same way as it did in TES:Oblivion ©. The wikipedia and your friends won’t be able to help you because all the recipes are randomized for each character and the only way to learn them all is by experimentation. Farming will demand a sound understanding of different crops, soil fertilization and knowledge regarding when to plant or harvest your crops according to the current weather. A great example of farming knowledge is knowing your crop fertilizer comes from your stables and barns which you need to manage and clean in order to breed the best war horses on the continent! You also will need to feed and tend your other livestock as well.  Food is very important for character development and skill progression. The higher the quality of the food your character eats the faster they will progress through their skills. This places a cook on the same level as other craftspeople such as blacksmiths, carpenters or alchemists. These are only a few features that are listed. Craft and construct hundreds of items and build unique structures to create the world around you. Your imagination will be your only limitation as hundreds of personal choices and customization will offer endless combinations in  "}]